zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_PORT.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_SW_PORT.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_SW_PORT
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_SW_PORT_H_)  /* Check if memory map has not been already included */
#define S32K566_SW_PORT_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- SW_PORT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SW_PORT_Peripheral_Access_Layer SW_PORT Peripheral Access Layer
 * @{
 */

/** SW_PORT - Size of Registers Arrays */
#define SW_PORT_TCT_NUM_COUNT                     8u

/** SW_PORT - Register Layout Typedef */
typedef struct SW_PORT_Struct {
  __I  uint32_t PCAPR;                             /**< Port capability register, offset: 0x0 */
  __I  uint32_t PMCAPR;                            /**< Port MAC capability register, offset: 0x4 */
  __I  uint32_t PIOCAPR;                           /**< Port I/O capability register, offset: 0x8 */
  uint8_t RESERVED_0[4];
  __IO uint32_t PCR;                               /**< Port configuration register, offset: 0x10 */
  uint8_t RESERVED_1[12];
  __IO uint32_t PMAR0;                             /**< Port MAC address register 0, offset: 0x20 */
  __IO uint32_t PMAR1;                             /**< Port MAC address register 1, offset: 0x24 */
  uint8_t RESERVED_2[40];
  __IO uint32_t PTAR;                              /**< Port TPID acceptance register, offset: 0x50 */
  __IO uint32_t PQOSMR;                            /**< Port QoS mode register, offset: 0x54 */
  uint8_t RESERVED_3[8];
  __I  uint32_t PQOR;                              /**< Port Queue Operational register, offset: 0x60 */
  uint8_t RESERVED_4[28];
  __IO uint32_t PPCR;                              /**< Port parser configuration register, offset: 0x80 */
  __IO uint32_t PIPFCR;                            /**< Port ingress port filter configuration register, offset: 0x84 */
  uint8_t RESERVED_5[24];
  __IO uint32_t PSGCR;                             /**< Port stream gate configuration register, offset: 0xA0 */
  uint8_t RESERVED_6[92];
  __IO uint32_t POR;                               /**< Port operational register, offset: 0x100 */
  __I  uint32_t PSR;                               /**< Port status register, offset: 0x104 */
  __IO uint32_t PRXSDUOR;                          /**< Port receive SDU overhead register, offset: 0x108 */
  __IO uint32_t PTXSDUOR;                          /**< Port transmit SDU overhead register, offset: 0x10C */
  __IO uint32_t PTGSCR;                            /**< Port time gate scheduling control register, offset: 0x110 */
  __I  uint32_t PTGAGLSR;                          /**< Port time gate scheduling admin gate list status register, offset: 0x114 */
  __I  uint32_t PTGAGLLR;                          /**< Port time gate scheduling admin gate list length register, offset: 0x118 */
  __I  uint32_t PTGOGLLR;                          /**< Port time gating operational gate list length register, offset: 0x11C */
  uint8_t RESERVED_7[4];
  __I  uint32_t PTGSHAR;                           /**< Port time gate scheduling hold advance register, offset: 0x124, not available in all instances (available on 3 out of 6) */
  __I  uint32_t PTGSRAR;                           /**< Port time gate scheduling release advance register, offset: 0x128, not available in all instances (available on 3 out of 6) */
  __IO uint32_t PTGSHCR;                           /**< Port time gate scheduling hold configuration register, offset: 0x12C, not available in all instances (available on 3 out of 6) */
  uint8_t RESERVED_8[4];
  __IO uint32_t PFPCR;                             /**< Port frame preemption configuration register, offset: 0x134, not available in all instances (available on 3 out of 6) */
  __IO uint32_t PDGSR;                             /**< Port default gate state register, offset: 0x138 */
  uint8_t RESERVED_9[132];
  __I  uint32_t PRXDCR;                            /**< Port Rx discard count register, offset: 0x1C0 */
  uint8_t RESERVED_10[4];
  __IO uint32_t PRXDCRR0;                          /**< Port Rx discard count reason register 0, offset: 0x1C8 */
  __IO uint32_t PRXDCRR1;                          /**< Port Rx discard count reason register 1, offset: 0x1CC */
  uint8_t RESERVED_11[16];
  __I  uint32_t PTXDCR;                            /**< Port Tx discard count register, offset: 0x1E0 */
  uint8_t RESERVED_12[4];
  __IO uint32_t PTXDCRR0;                          /**< Port Tx discard count reason register 0, offset: 0x1E8 */
  __IO uint32_t PTXDCRR1;                          /**< Port Tx discard count reason register 1, offset: 0x1EC */
  uint8_t RESERVED_13[16];
  struct SW_PORT_TCT_NUM {                         /* offset: 0x200, array step: 0x20 */
    __I  uint32_t PTGSTCSR;                          /**< Port time gate scheduling traffic class 0 status register..Port time gate scheduling traffic class 7 status register, array offset: 0x200, array step: 0x20 */
    __I  uint32_t PTGSTCOCR;                         /**< Port time gate scheduling traffic class 0 overrun counter register..Port time gate scheduling traffic class 7 overrun counter register, array offset: 0x204, array step: 0x20 */
    __IO uint32_t PTCTMSDUR;                         /**< Port traffic class 0 transmit maximum SDU register..Port traffic class 7 transmit maximum SDU register, array offset: 0x208, array step: 0x20 */
    uint8_t RESERVED_0[4];
    __IO uint32_t PTCCBSR0;                          /**< Port transmit traffic class 0 credit based shaper register 0..Port transmit traffic class 7 credit based shaper register 0, array offset: 0x210, array step: 0x20 */
    __IO uint32_t PTCCBSR1;                          /**< Port traffic class 0 credit based shaper register 1..Port traffic class 7 credit based shaper register 1, array offset: 0x214, array step: 0x20 */
    __IO uint32_t PTCCBSR2;                          /**< Port transmit traffic class 0 credit based shaper register 2..Port transmit traffic class 7 credit based shaper register 2, array offset: 0x218, array step: 0x20 */
    uint8_t RESERVED_1[4];
  } TCT_NUM[SW_PORT_TCT_NUM_COUNT];
  uint8_t RESERVED_14[256];
  __IO uint32_t PBPMCR0;                           /**< Port buffer pool mapping configuration register 0, offset: 0x400 */
  __IO uint32_t PBPMCR1;                           /**< Port buffer pool mapping configuration register 1, offset: 0x404 */
  uint8_t RESERVED_15[8];
  __IO uint32_t PGCR;                              /**< Port group configuration register, offset: 0x410 */
  uint8_t RESERVED_16[36];
  __IO uint32_t PPCPDEIMR;                         /**< Port PCP DEI mapping register, offset: 0x438 */
  uint8_t RESERVED_17[4];
  __IO uint32_t PMCR;                              /**< Port mirror configuration register, offset: 0x440 */
  __IO uint32_t PMCR1;                             /**< Port mirror configuration register 1, offset: 0x444 */
  __IO uint32_t PMCR2;                             /**< Port mirror configuration register 2, offset: 0x448 */
  uint8_t RESERVED_18[4];
  __IO uint32_t PCTFCR;                            /**< Port cut through forwarding configuration register, offset: 0x450, not available in all instances (available on 5 out of 6) */
  uint8_t RESERVED_19[12];
  __IO uint32_t PISIDCR;                           /**< Port ingress stream identification configuration register, offset: 0x460 */
  __IO uint32_t PFMCR;                             /**< Port frame modification configuration register, offset: 0x464 */
  uint8_t RESERVED_20[8];
  __IO uint32_t PIPV2QMR0;                         /**< Port IPV to queue mapping register 0, offset: 0x470 */
  uint8_t RESERVED_21[60];
  __I  uint32_t PTCMINLR;                          /**< Port time capture minimum latency register, offset: 0x4B0 */
  __I  uint32_t PTCMAXLR;                          /**< Port time capture maximum latency register, offset: 0x4B4 */
  uint8_t RESERVED_22[8];
  __IO uint32_t PSRCR;                             /**< Port seamless redundancy configuration register, offset: 0x4C0 */
  uint8_t RESERVED_23[60];
  __IO uint32_t BPCR;                              /**< Bridge port configuration register, offset: 0x500 */
  uint8_t RESERVED_24[12];
  __IO uint32_t BPDVR;                             /**< Bridge port default VLAN register, offset: 0x510 */
  uint8_t RESERVED_25[12];
  __IO uint32_t BPSTGSR;                           /**< Bridge port spanning tree group state register, offset: 0x520 */
  uint8_t RESERVED_26[4];
  __IO uint32_t BPSCR0;                            /**< Bridge port storm control register 0, offset: 0x528 */
  __IO uint32_t BPSCR1;                            /**< Bridge port storm control register 1, offset: 0x52C */
  __I  uint32_t BPOR;                              /**< Bridge port operational register, offset: 0x530 */
  uint8_t RESERVED_27[76];
  __I  uint32_t BPDCR;                             /**< Bridge port discard count register, offset: 0x580 */
  uint8_t RESERVED_28[4];
  __IO uint32_t BPDCRR0;                           /**< Bridge port discard count reason register 0, offset: 0x588 */
  __IO uint32_t BPDCRR1;                           /**< Bridge port discard count reason register 1, offset: 0x58C */
  __IO uint32_t BPMLFSR;                           /**< Bridge port MAC learning failure status register, offset: 0x590 */
} SW_PORT_Type, *SW_PORT_MemMapPtr;

/** Number of instances of the SW_PORT module. */
#define SW_PORT_INSTANCE_COUNT                   (6u)

/* SW_PORT - Peripheral instance base addresses */
/** Peripheral NETC__SW0_PORT0 base address */
#define IP_NETC__SW0_PORT0_BASE                  (0x6D004000u)
/** Peripheral NETC__SW0_PORT0 base pointer */
#define IP_NETC__SW0_PORT0                       ((SW_PORT_Type *)IP_NETC__SW0_PORT0_BASE)
/** Peripheral NETC__SW0_PORT1 base address */
#define IP_NETC__SW0_PORT1_BASE                  (0x6D008000u)
/** Peripheral NETC__SW0_PORT1 base pointer */
#define IP_NETC__SW0_PORT1                       ((SW_PORT_Type *)IP_NETC__SW0_PORT1_BASE)
/** Peripheral NETC__SW0_PORT2 base address */
#define IP_NETC__SW0_PORT2_BASE                  (0x6D00C000u)
/** Peripheral NETC__SW0_PORT2 base pointer */
#define IP_NETC__SW0_PORT2                       ((SW_PORT_Type *)IP_NETC__SW0_PORT2_BASE)
/** Peripheral NETC__SW0_PORT3 base address */
#define IP_NETC__SW0_PORT3_BASE                  (0x6D010000u)
/** Peripheral NETC__SW0_PORT3 base pointer */
#define IP_NETC__SW0_PORT3                       ((SW_PORT_Type *)IP_NETC__SW0_PORT3_BASE)
/** Peripheral NETC__SW0_PORT4 base address */
#define IP_NETC__SW0_PORT4_BASE                  (0x6D014000u)
/** Peripheral NETC__SW0_PORT4 base pointer */
#define IP_NETC__SW0_PORT4                       ((SW_PORT_Type *)IP_NETC__SW0_PORT4_BASE)
/** Peripheral NETC__SW0_PORT5 base address */
#define IP_NETC__SW0_PORT5_BASE                  (0x6D018000u)
/** Peripheral NETC__SW0_PORT5 base pointer */
#define IP_NETC__SW0_PORT5                       ((SW_PORT_Type *)IP_NETC__SW0_PORT5_BASE)
/** Array initializer of SW_PORT peripheral base addresses */
#define IP_SW_PORT_BASE_ADDRS                    { IP_NETC__SW0_PORT0_BASE, IP_NETC__SW0_PORT1_BASE, IP_NETC__SW0_PORT2_BASE, IP_NETC__SW0_PORT3_BASE, IP_NETC__SW0_PORT4_BASE, IP_NETC__SW0_PORT5_BASE }
/** Array initializer of SW_PORT peripheral base pointers */
#define IP_SW_PORT_BASE_PTRS                     { IP_NETC__SW0_PORT0, IP_NETC__SW0_PORT1, IP_NETC__SW0_PORT2, IP_NETC__SW0_PORT3, IP_NETC__SW0_PORT4, IP_NETC__SW0_PORT5 }

/* ----------------------------------------------------------------------------
   -- SW_PORT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SW_PORT_Register_Masks SW_PORT Register Masks
 * @{
 */

