zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_PORT.h
/*! @name PCAPR - Port capability register */
/*! @{ */

#define SW_PORT_PCAPR_LINK_TYPE_MASK             (0x10U)
#define SW_PORT_PCAPR_LINK_TYPE_SHIFT            (4U)
#define SW_PORT_PCAPR_LINK_TYPE_WIDTH            (1U)
#define SW_PORT_PCAPR_LINK_TYPE(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCAPR_LINK_TYPE_SHIFT)) & SW_PORT_PCAPR_LINK_TYPE_MASK)

#define SW_PORT_PCAPR_NUM_TC_MASK                (0xF000U)
#define SW_PORT_PCAPR_NUM_TC_SHIFT               (12U)
#define SW_PORT_PCAPR_NUM_TC_WIDTH               (4U)
#define SW_PORT_PCAPR_NUM_TC(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCAPR_NUM_TC_SHIFT)) & SW_PORT_PCAPR_NUM_TC_MASK)

#define SW_PORT_PCAPR_NUM_Q_MASK                 (0xF0000U)
#define SW_PORT_PCAPR_NUM_Q_SHIFT                (16U)
#define SW_PORT_PCAPR_NUM_Q_WIDTH                (4U)
#define SW_PORT_PCAPR_NUM_Q(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCAPR_NUM_Q_SHIFT)) & SW_PORT_PCAPR_NUM_Q_MASK)

#define SW_PORT_PCAPR_NUM_CBS_MASK               (0x700000U)
#define SW_PORT_PCAPR_NUM_CBS_SHIFT              (20U)
#define SW_PORT_PCAPR_NUM_CBS_WIDTH              (3U)
#define SW_PORT_PCAPR_NUM_CBS(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCAPR_NUM_CBS_SHIFT)) & SW_PORT_PCAPR_NUM_CBS_MASK)

#define SW_PORT_PCAPR_NUM_CG_MASK                (0xF000000U)
#define SW_PORT_PCAPR_NUM_CG_SHIFT               (24U)
#define SW_PORT_PCAPR_NUM_CG_WIDTH               (4U)
#define SW_PORT_PCAPR_NUM_CG(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCAPR_NUM_CG_SHIFT)) & SW_PORT_PCAPR_NUM_CG_MASK)

#define SW_PORT_PCAPR_TGS_MASK                   (0x10000000U)
#define SW_PORT_PCAPR_TGS_SHIFT                  (28U)
#define SW_PORT_PCAPR_TGS_WIDTH                  (1U)
#define SW_PORT_PCAPR_TGS(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCAPR_TGS_SHIFT)) & SW_PORT_PCAPR_TGS_MASK)

#define SW_PORT_PCAPR_CBS_MASK                   (0x20000000U)
#define SW_PORT_PCAPR_CBS_SHIFT                  (29U)
#define SW_PORT_PCAPR_CBS_WIDTH                  (1U)
#define SW_PORT_PCAPR_CBS(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCAPR_CBS_SHIFT)) & SW_PORT_PCAPR_CBS_MASK)

#define SW_PORT_PCAPR_ECBS_MASK                  (0x40000000U)
#define SW_PORT_PCAPR_ECBS_SHIFT                 (30U)
#define SW_PORT_PCAPR_ECBS_WIDTH                 (1U)
#define SW_PORT_PCAPR_ECBS(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCAPR_ECBS_SHIFT)) & SW_PORT_PCAPR_ECBS_MASK)

#define SW_PORT_PCAPR_ATS_MASK                   (0x80000000U)
#define SW_PORT_PCAPR_ATS_SHIFT                  (31U)
#define SW_PORT_PCAPR_ATS_WIDTH                  (1U)
#define SW_PORT_PCAPR_ATS(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCAPR_ATS_SHIFT)) & SW_PORT_PCAPR_ATS_MASK)
/*! @} */

/*! @name PMCAPR - Port MAC capability register */
/*! @{ */

#define SW_PORT_PMCAPR_MAC_VAR_MASK              (0x7U)
#define SW_PORT_PMCAPR_MAC_VAR_SHIFT             (0U)
#define SW_PORT_PMCAPR_MAC_VAR_WIDTH             (3U)
#define SW_PORT_PMCAPR_MAC_VAR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCAPR_MAC_VAR_SHIFT)) & SW_PORT_PMCAPR_MAC_VAR_MASK)

#define SW_PORT_PMCAPR_EFPAD_MASK                (0x30U)
#define SW_PORT_PMCAPR_EFPAD_SHIFT               (4U)
#define SW_PORT_PMCAPR_EFPAD_WIDTH               (2U)
#define SW_PORT_PMCAPR_EFPAD(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCAPR_EFPAD_SHIFT)) & SW_PORT_PMCAPR_EFPAD_MASK)

#define SW_PORT_PMCAPR_PIPG_MASK                 (0x40U)
#define SW_PORT_PMCAPR_PIPG_SHIFT                (6U)
#define SW_PORT_PMCAPR_PIPG_WIDTH                (1U)
#define SW_PORT_PMCAPR_PIPG(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCAPR_PIPG_SHIFT)) & SW_PORT_PMCAPR_PIPG_MASK)

#define SW_PORT_PMCAPR_HD_MASK                   (0x100U)
#define SW_PORT_PMCAPR_HD_SHIFT                  (8U)
#define SW_PORT_PMCAPR_HD_WIDTH                  (1U)
#define SW_PORT_PMCAPR_HD(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCAPR_HD_SHIFT)) & SW_PORT_PMCAPR_HD_MASK)

#define SW_PORT_PMCAPR_FP_MASK                   (0x600U)
#define SW_PORT_PMCAPR_FP_SHIFT                  (9U)
#define SW_PORT_PMCAPR_FP_WIDTH                  (2U)
#define SW_PORT_PMCAPR_FP(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCAPR_FP_SHIFT)) & SW_PORT_PMCAPR_FP_MASK)

#define SW_PORT_PMCAPR_MIN_MPDU_MASK             (0x1000U)
#define SW_PORT_PMCAPR_MIN_MPDU_SHIFT            (12U)
#define SW_PORT_PMCAPR_MIN_MPDU_WIDTH            (1U)
#define SW_PORT_PMCAPR_MIN_MPDU(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCAPR_MIN_MPDU_SHIFT)) & SW_PORT_PMCAPR_MIN_MPDU_MASK)

#define SW_PORT_PMCAPR_MSEC_MASK                 (0x2000U)
#define SW_PORT_PMCAPR_MSEC_SHIFT                (13U)
#define SW_PORT_PMCAPR_MSEC_WIDTH                (1U)
#define SW_PORT_PMCAPR_MSEC(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCAPR_MSEC_SHIFT)) & SW_PORT_PMCAPR_MSEC_MASK)

#define SW_PORT_PMCAPR_RGMII_DLY_MODE_CAP_MASK   (0x300000U)
#define SW_PORT_PMCAPR_RGMII_DLY_MODE_CAP_SHIFT  (20U)
#define SW_PORT_PMCAPR_RGMII_DLY_MODE_CAP_WIDTH  (2U)
#define SW_PORT_PMCAPR_RGMII_DLY_MODE_CAP(x)     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCAPR_RGMII_DLY_MODE_CAP_SHIFT)) & SW_PORT_PMCAPR_RGMII_DLY_MODE_CAP_MASK)

#define SW_PORT_PMCAPR_MII_PROT_MASK             (0xF000000U)
#define SW_PORT_PMCAPR_MII_PROT_SHIFT            (24U)
#define SW_PORT_PMCAPR_MII_PROT_WIDTH            (4U)
#define SW_PORT_PMCAPR_MII_PROT(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCAPR_MII_PROT_SHIFT)) & SW_PORT_PMCAPR_MII_PROT_MASK)
/*! @} */

/*! @name PIOCAPR - Port I/O capability register */
/*! @{ */

#define SW_PORT_PIOCAPR_PCS_PROT_MASK            (0xFFFFU)
#define SW_PORT_PIOCAPR_PCS_PROT_SHIFT           (0U)
#define SW_PORT_PIOCAPR_PCS_PROT_WIDTH           (16U)
#define SW_PORT_PIOCAPR_PCS_PROT(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PIOCAPR_PCS_PROT_SHIFT)) & SW_PORT_PIOCAPR_PCS_PROT_MASK)

#define SW_PORT_PIOCAPR_IO_VAR_MASK              (0xF000000U)
#define SW_PORT_PIOCAPR_IO_VAR_SHIFT             (24U)
#define SW_PORT_PIOCAPR_IO_VAR_WIDTH             (4U)
#define SW_PORT_PIOCAPR_IO_VAR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PIOCAPR_IO_VAR_SHIFT)) & SW_PORT_PIOCAPR_IO_VAR_MASK)

#define SW_PORT_PIOCAPR_EMDIO_MASK               (0x10000000U)
#define SW_PORT_PIOCAPR_EMDIO_SHIFT              (28U)
#define SW_PORT_PIOCAPR_EMDIO_WIDTH              (1U)
#define SW_PORT_PIOCAPR_EMDIO(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PIOCAPR_EMDIO_SHIFT)) & SW_PORT_PIOCAPR_EMDIO_MASK)

#define SW_PORT_PIOCAPR_REVMII_RATE_MASK         (0x40000000U)
#define SW_PORT_PIOCAPR_REVMII_RATE_SHIFT        (30U)
#define SW_PORT_PIOCAPR_REVMII_RATE_WIDTH        (1U)
#define SW_PORT_PIOCAPR_REVMII_RATE(x)           (((uint32_t)(((uint32_t)(x)) << SW_PORT_PIOCAPR_REVMII_RATE_SHIFT)) & SW_PORT_PIOCAPR_REVMII_RATE_MASK)

