zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_PORT.h
#define SW_PORT_PIOCAPR_REVMII_MASK              (0x80000000U)
#define SW_PORT_PIOCAPR_REVMII_SHIFT             (31U)
#define SW_PORT_PIOCAPR_REVMII_WIDTH             (1U)
#define SW_PORT_PIOCAPR_REVMII(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PIOCAPR_REVMII_SHIFT)) & SW_PORT_PIOCAPR_REVMII_MASK)
/*! @} */

/*! @name PCR - Port configuration register */
/*! @{ */

#define SW_PORT_PCR_HDR_FMT_MASK                 (0x1U)
#define SW_PORT_PCR_HDR_FMT_SHIFT                (0U)
#define SW_PORT_PCR_HDR_FMT_WIDTH                (1U)
#define SW_PORT_PCR_HDR_FMT(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCR_HDR_FMT_SHIFT)) & SW_PORT_PCR_HDR_FMT_MASK)

#define SW_PORT_PCR_NS_TAG_PORT_MASK             (0x8U)
#define SW_PORT_PCR_NS_TAG_PORT_SHIFT            (3U)
#define SW_PORT_PCR_NS_TAG_PORT_WIDTH            (1U)
#define SW_PORT_PCR_NS_TAG_PORT(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCR_NS_TAG_PORT_SHIFT)) & SW_PORT_PCR_NS_TAG_PORT_MASK)

#define SW_PORT_PCR_L2DOSE_MASK                  (0x10U)
#define SW_PORT_PCR_L2DOSE_SHIFT                 (4U)
#define SW_PORT_PCR_L2DOSE_WIDTH                 (1U)
#define SW_PORT_PCR_L2DOSE(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCR_L2DOSE_SHIFT)) & SW_PORT_PCR_L2DOSE_MASK)

#define SW_PORT_PCR_L3DOSE_MASK                  (0x20U)
#define SW_PORT_PCR_L3DOSE_SHIFT                 (5U)
#define SW_PORT_PCR_L3DOSE_WIDTH                 (1U)
#define SW_PORT_PCR_L3DOSE(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCR_L3DOSE_SHIFT)) & SW_PORT_PCR_L3DOSE_MASK)

#define SW_PORT_PCR_TIMER_CS_MASK                (0x100U)
#define SW_PORT_PCR_TIMER_CS_SHIFT               (8U)
#define SW_PORT_PCR_TIMER_CS_WIDTH               (1U)
#define SW_PORT_PCR_TIMER_CS(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCR_TIMER_CS_SHIFT)) & SW_PORT_PCR_TIMER_CS_MASK)

#define SW_PORT_PCR_FCSEA_MASK                   (0x1000U)
#define SW_PORT_PCR_FCSEA_SHIFT                  (12U)
#define SW_PORT_PCR_FCSEA_WIDTH                  (1U)
#define SW_PORT_PCR_FCSEA(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCR_FCSEA_SHIFT)) & SW_PORT_PCR_FCSEA_MASK)

#define SW_PORT_PCR_PSPEED_MASK                  (0x3FFF0000U)
#define SW_PORT_PCR_PSPEED_SHIFT                 (16U)
#define SW_PORT_PCR_PSPEED_WIDTH                 (14U)
#define SW_PORT_PCR_PSPEED(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCR_PSPEED_SHIFT)) & SW_PORT_PCR_PSPEED_MASK)
/*! @} */

/*! @name PMAR0 - Port MAC address register 0 */
/*! @{ */

#define SW_PORT_PMAR0_PRIM_MAC_ADDR_MASK         (0xFFFFFFFFU)
#define SW_PORT_PMAR0_PRIM_MAC_ADDR_SHIFT        (0U)
#define SW_PORT_PMAR0_PRIM_MAC_ADDR_WIDTH        (32U)
#define SW_PORT_PMAR0_PRIM_MAC_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMAR0_PRIM_MAC_ADDR_SHIFT)) & SW_PORT_PMAR0_PRIM_MAC_ADDR_MASK)
/*! @} */

/*! @name PMAR1 - Port MAC address register 1 */
/*! @{ */

#define SW_PORT_PMAR1_PRIM_MAC_ADDR_MASK         (0xFFFFU)
#define SW_PORT_PMAR1_PRIM_MAC_ADDR_SHIFT        (0U)
#define SW_PORT_PMAR1_PRIM_MAC_ADDR_WIDTH        (16U)
#define SW_PORT_PMAR1_PRIM_MAC_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMAR1_PRIM_MAC_ADDR_SHIFT)) & SW_PORT_PMAR1_PRIM_MAC_ADDR_MASK)
/*! @} */

/*! @name PTAR - Port TPID acceptance register */
/*! @{ */

#define SW_PORT_PTAR_OVTPIDL_MASK                (0xFU)
#define SW_PORT_PTAR_OVTPIDL_SHIFT               (0U)
#define SW_PORT_PTAR_OVTPIDL_WIDTH               (4U)
#define SW_PORT_PTAR_OVTPIDL(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTAR_OVTPIDL_SHIFT)) & SW_PORT_PTAR_OVTPIDL_MASK)

#define SW_PORT_PTAR_IVTPIDL_MASK                (0xF0U)
#define SW_PORT_PTAR_IVTPIDL_SHIFT               (4U)
#define SW_PORT_PTAR_IVTPIDL_WIDTH               (4U)
#define SW_PORT_PTAR_IVTPIDL(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTAR_IVTPIDL_SHIFT)) & SW_PORT_PTAR_IVTPIDL_MASK)
/*! @} */

/*! @name PQOSMR - Port QoS mode register */
/*! @{ */

#define SW_PORT_PQOSMR_VS_MASK                   (0x1U)
#define SW_PORT_PQOSMR_VS_SHIFT                  (0U)
#define SW_PORT_PQOSMR_VS_WIDTH                  (1U)
#define SW_PORT_PQOSMR_VS(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PQOSMR_VS_SHIFT)) & SW_PORT_PQOSMR_VS_MASK)

#define SW_PORT_PQOSMR_VE_MASK                   (0x2U)
#define SW_PORT_PQOSMR_VE_SHIFT                  (1U)
#define SW_PORT_PQOSMR_VE_WIDTH                  (1U)
#define SW_PORT_PQOSMR_VE(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PQOSMR_VE_SHIFT)) & SW_PORT_PQOSMR_VE_MASK)

#define SW_PORT_PQOSMR_DDR_MASK                  (0xCU)
#define SW_PORT_PQOSMR_DDR_SHIFT                 (2U)
#define SW_PORT_PQOSMR_DDR_WIDTH                 (2U)
#define SW_PORT_PQOSMR_DDR(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_PQOSMR_DDR_SHIFT)) & SW_PORT_PQOSMR_DDR_MASK)

#define SW_PORT_PQOSMR_DIPV_MASK                 (0x70U)
#define SW_PORT_PQOSMR_DIPV_SHIFT                (4U)
#define SW_PORT_PQOSMR_DIPV_WIDTH                (3U)
#define SW_PORT_PQOSMR_DIPV(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PQOSMR_DIPV_SHIFT)) & SW_PORT_PQOSMR_DIPV_MASK)

#define SW_PORT_PQOSMR_VQMP_MASK                 (0xF0000U)
#define SW_PORT_PQOSMR_VQMP_SHIFT                (16U)
#define SW_PORT_PQOSMR_VQMP_WIDTH                (4U)
#define SW_PORT_PQOSMR_VQMP(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PQOSMR_VQMP_SHIFT)) & SW_PORT_PQOSMR_VQMP_MASK)

#define SW_PORT_PQOSMR_QVMP_MASK                 (0xF00000U)
#define SW_PORT_PQOSMR_QVMP_SHIFT                (20U)
#define SW_PORT_PQOSMR_QVMP_WIDTH                (4U)
#define SW_PORT_PQOSMR_QVMP(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PQOSMR_QVMP_SHIFT)) & SW_PORT_PQOSMR_QVMP_MASK)
/*! @} */

/*! @name PQOR - Port Queue Operational register */
/*! @{ */

#define SW_PORT_PQOR_Q0S_MASK                    (0x1U)
#define SW_PORT_PQOR_Q0S_SHIFT                   (0U)
#define SW_PORT_PQOR_Q0S_WIDTH                   (1U)
#define SW_PORT_PQOR_Q0S(x)                      (((uint32_t)(((uint32_t)(x)) << SW_PORT_PQOR_Q0S_SHIFT)) & SW_PORT_PQOR_Q0S_MASK)

#define SW_PORT_PQOR_Q1S_MASK                    (0x2U)
#define SW_PORT_PQOR_Q1S_SHIFT                   (1U)
#define SW_PORT_PQOR_Q1S_WIDTH                   (1U)
#define SW_PORT_PQOR_Q1S(x)                      (((uint32_t)(((uint32_t)(x)) << SW_PORT_PQOR_Q1S_SHIFT)) & SW_PORT_PQOR_Q1S_MASK)

#define SW_PORT_PQOR_Q2S_MASK                    (0x4U)
#define SW_PORT_PQOR_Q2S_SHIFT                   (2U)
#define SW_PORT_PQOR_Q2S_WIDTH                   (1U)
#define SW_PORT_PQOR_Q2S(x)                      (((uint32_t)(((uint32_t)(x)) << SW_PORT_PQOR_Q2S_SHIFT)) & SW_PORT_PQOR_Q2S_MASK)

#define SW_PORT_PQOR_Q3S_MASK                    (0x8U)
#define SW_PORT_PQOR_Q3S_SHIFT                   (3U)
#define SW_PORT_PQOR_Q3S_WIDTH                   (1U)
#define SW_PORT_PQOR_Q3S(x)                      (((uint32_t)(((uint32_t)(x)) << SW_PORT_PQOR_Q3S_SHIFT)) & SW_PORT_PQOR_Q3S_MASK)

