zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_PORT.h
#define SW_PORT_PQOR_Q4S_MASK                    (0x10U)
#define SW_PORT_PQOR_Q4S_SHIFT                   (4U)
#define SW_PORT_PQOR_Q4S_WIDTH                   (1U)
#define SW_PORT_PQOR_Q4S(x)                      (((uint32_t)(((uint32_t)(x)) << SW_PORT_PQOR_Q4S_SHIFT)) & SW_PORT_PQOR_Q4S_MASK)

#define SW_PORT_PQOR_Q5S_MASK                    (0x20U)
#define SW_PORT_PQOR_Q5S_SHIFT                   (5U)
#define SW_PORT_PQOR_Q5S_WIDTH                   (1U)
#define SW_PORT_PQOR_Q5S(x)                      (((uint32_t)(((uint32_t)(x)) << SW_PORT_PQOR_Q5S_SHIFT)) & SW_PORT_PQOR_Q5S_MASK)

#define SW_PORT_PQOR_Q6S_MASK                    (0x40U)
#define SW_PORT_PQOR_Q6S_SHIFT                   (6U)
#define SW_PORT_PQOR_Q6S_WIDTH                   (1U)
#define SW_PORT_PQOR_Q6S(x)                      (((uint32_t)(((uint32_t)(x)) << SW_PORT_PQOR_Q6S_SHIFT)) & SW_PORT_PQOR_Q6S_MASK)

#define SW_PORT_PQOR_Q7S_MASK                    (0x80U)
#define SW_PORT_PQOR_Q7S_SHIFT                   (7U)
#define SW_PORT_PQOR_Q7S_WIDTH                   (1U)
#define SW_PORT_PQOR_Q7S(x)                      (((uint32_t)(((uint32_t)(x)) << SW_PORT_PQOR_Q7S_SHIFT)) & SW_PORT_PQOR_Q7S_MASK)
/*! @} */

/*! @name PPCR - Port parser configuration register */
/*! @{ */

#define SW_PORT_PPCR_L1PFS_MASK                  (0x3EU)
#define SW_PORT_PPCR_L1PFS_SHIFT                 (1U)
#define SW_PORT_PPCR_L1PFS_WIDTH                 (5U)
#define SW_PORT_PPCR_L1PFS(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCR_L1PFS_SHIFT)) & SW_PORT_PPCR_L1PFS_MASK)

#define SW_PORT_PPCR_L2PFS_MASK                  (0x3E00U)
#define SW_PORT_PPCR_L2PFS_SHIFT                 (9U)
#define SW_PORT_PPCR_L2PFS_WIDTH                 (5U)
#define SW_PORT_PPCR_L2PFS(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCR_L2PFS_SHIFT)) & SW_PORT_PPCR_L2PFS_MASK)

#define SW_PORT_PPCR_L3HFP_MASK                  (0x10000U)
#define SW_PORT_PPCR_L3HFP_SHIFT                 (16U)
#define SW_PORT_PPCR_L3HFP_WIDTH                 (1U)
#define SW_PORT_PPCR_L3HFP(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCR_L3HFP_SHIFT)) & SW_PORT_PPCR_L3HFP_MASK)

#define SW_PORT_PPCR_L3PFS_MASK                  (0x3E0000U)
#define SW_PORT_PPCR_L3PFS_SHIFT                 (17U)
#define SW_PORT_PPCR_L3PFS_WIDTH                 (5U)
#define SW_PORT_PPCR_L3PFS(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCR_L3PFS_SHIFT)) & SW_PORT_PPCR_L3PFS_MASK)

#define SW_PORT_PPCR_L4HFP_MASK                  (0x1000000U)
#define SW_PORT_PPCR_L4HFP_SHIFT                 (24U)
#define SW_PORT_PPCR_L4HFP_WIDTH                 (1U)
#define SW_PORT_PPCR_L4HFP(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCR_L4HFP_SHIFT)) & SW_PORT_PPCR_L4HFP_MASK)

#define SW_PORT_PPCR_L4PFS_MASK                  (0x3E000000U)
#define SW_PORT_PPCR_L4PFS_SHIFT                 (25U)
#define SW_PORT_PPCR_L4PFS_WIDTH                 (5U)
#define SW_PORT_PPCR_L4PFS(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCR_L4PFS_SHIFT)) & SW_PORT_PPCR_L4PFS_MASK)
/*! @} */

/*! @name PIPFCR - Port ingress port filter configuration register */
/*! @{ */

#define SW_PORT_PIPFCR_EN_MASK                   (0x1U)
#define SW_PORT_PIPFCR_EN_SHIFT                  (0U)
#define SW_PORT_PIPFCR_EN_WIDTH                  (1U)
#define SW_PORT_PIPFCR_EN(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PIPFCR_EN_SHIFT)) & SW_PORT_PIPFCR_EN_MASK)
/*! @} */

/*! @name PSGCR - Port stream gate configuration register */
/*! @{ */

#define SW_PORT_PSGCR_PDELAY_MASK                (0xFFFFFFU)
#define SW_PORT_PSGCR_PDELAY_SHIFT               (0U)
#define SW_PORT_PSGCR_PDELAY_WIDTH               (24U)
#define SW_PORT_PSGCR_PDELAY(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_PSGCR_PDELAY_SHIFT)) & SW_PORT_PSGCR_PDELAY_MASK)

#define SW_PORT_PSGCR_OGC_MASK                   (0x80000000U)
#define SW_PORT_PSGCR_OGC_SHIFT                  (31U)
#define SW_PORT_PSGCR_OGC_WIDTH                  (1U)
#define SW_PORT_PSGCR_OGC(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PSGCR_OGC_SHIFT)) & SW_PORT_PSGCR_OGC_MASK)
/*! @} */

/*! @name POR - Port operational register */
/*! @{ */

#define SW_PORT_POR_TXDIS_MASK                   (0x1U)
#define SW_PORT_POR_TXDIS_SHIFT                  (0U)
#define SW_PORT_POR_TXDIS_WIDTH                  (1U)
#define SW_PORT_POR_TXDIS(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_POR_TXDIS_SHIFT)) & SW_PORT_POR_TXDIS_MASK)

#define SW_PORT_POR_RXDIS_MASK                   (0x2U)
#define SW_PORT_POR_RXDIS_SHIFT                  (1U)
#define SW_PORT_POR_RXDIS_WIDTH                  (1U)
#define SW_PORT_POR_RXDIS(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_POR_RXDIS_SHIFT)) & SW_PORT_POR_RXDIS_MASK)
/*! @} */

/*! @name PSR - Port status register */
/*! @{ */

#define SW_PORT_PSR_TX_BUSY_MASK                 (0x1U)
#define SW_PORT_PSR_TX_BUSY_SHIFT                (0U)
#define SW_PORT_PSR_TX_BUSY_WIDTH                (1U)
#define SW_PORT_PSR_TX_BUSY(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PSR_TX_BUSY_SHIFT)) & SW_PORT_PSR_TX_BUSY_MASK)

#define SW_PORT_PSR_RX_BUSY_MASK                 (0x2U)
#define SW_PORT_PSR_RX_BUSY_SHIFT                (1U)
#define SW_PORT_PSR_RX_BUSY_WIDTH                (1U)
#define SW_PORT_PSR_RX_BUSY(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PSR_RX_BUSY_SHIFT)) & SW_PORT_PSR_RX_BUSY_MASK)
/*! @} */

/*! @name PRXSDUOR - Port receive SDU overhead register */
/*! @{ */

#define SW_PORT_PRXSDUOR_PPDU_BCO_MASK           (0x1FU)
#define SW_PORT_PRXSDUOR_PPDU_BCO_SHIFT          (0U)
#define SW_PORT_PRXSDUOR_PPDU_BCO_WIDTH          (5U)
#define SW_PORT_PRXSDUOR_PPDU_BCO(x)             (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXSDUOR_PPDU_BCO_SHIFT)) & SW_PORT_PRXSDUOR_PPDU_BCO_MASK)

#define SW_PORT_PRXSDUOR_MACSEC_BCO_MASK         (0x3F00U)
#define SW_PORT_PRXSDUOR_MACSEC_BCO_SHIFT        (8U)
#define SW_PORT_PRXSDUOR_MACSEC_BCO_WIDTH        (6U)
#define SW_PORT_PRXSDUOR_MACSEC_BCO(x)           (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXSDUOR_MACSEC_BCO_SHIFT)) & SW_PORT_PRXSDUOR_MACSEC_BCO_MASK)
/*! @} */

/*! @name PTXSDUOR - Port transmit SDU overhead register */
/*! @{ */

