zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_PORT.h
#define SW_PORT_PTXSDUOR_PPDU_BCO_MASK           (0x1FU)
#define SW_PORT_PTXSDUOR_PPDU_BCO_SHIFT          (0U)
#define SW_PORT_PTXSDUOR_PPDU_BCO_WIDTH          (5U)
#define SW_PORT_PTXSDUOR_PPDU_BCO(x)             (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXSDUOR_PPDU_BCO_SHIFT)) & SW_PORT_PTXSDUOR_PPDU_BCO_MASK)

#define SW_PORT_PTXSDUOR_MACSEC_BCO_MASK         (0x3F00U)
#define SW_PORT_PTXSDUOR_MACSEC_BCO_SHIFT        (8U)
#define SW_PORT_PTXSDUOR_MACSEC_BCO_WIDTH        (6U)
#define SW_PORT_PTXSDUOR_MACSEC_BCO(x)           (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXSDUOR_MACSEC_BCO_SHIFT)) & SW_PORT_PTXSDUOR_MACSEC_BCO_MASK)
/*! @} */

/*! @name PTGSCR - Port time gate scheduling control register */
/*! @{ */

#define SW_PORT_PTGSCR_TGE_MASK                  (0x80000000U)
#define SW_PORT_PTGSCR_TGE_SHIFT                 (31U)
#define SW_PORT_PTGSCR_TGE_WIDTH                 (1U)
#define SW_PORT_PTGSCR_TGE(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTGSCR_TGE_SHIFT)) & SW_PORT_PTGSCR_TGE_MASK)
/*! @} */

/*! @name PTGAGLSR - Port time gate scheduling admin gate list status register */
/*! @{ */

#define SW_PORT_PTGAGLSR_TG_MASK                 (0x1U)
#define SW_PORT_PTGAGLSR_TG_SHIFT                (0U)
#define SW_PORT_PTGAGLSR_TG_WIDTH                (1U)
#define SW_PORT_PTGAGLSR_TG(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTGAGLSR_TG_SHIFT)) & SW_PORT_PTGAGLSR_TG_MASK)

#define SW_PORT_PTGAGLSR_CFG_PEND_MASK           (0x2U)
#define SW_PORT_PTGAGLSR_CFG_PEND_SHIFT          (1U)
#define SW_PORT_PTGAGLSR_CFG_PEND_WIDTH          (1U)
#define SW_PORT_PTGAGLSR_CFG_PEND(x)             (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTGAGLSR_CFG_PEND_SHIFT)) & SW_PORT_PTGAGLSR_CFG_PEND_MASK)
/*! @} */

/*! @name PTGAGLLR - Port time gate scheduling admin gate list length register */
/*! @{ */

#define SW_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH_MASK (0xFFFFU)
#define SW_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH_SHIFT (0U)
#define SW_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH_WIDTH (16U)
#define SW_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH(x) (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH_SHIFT)) & SW_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH_MASK)
/*! @} */

/*! @name PTGOGLLR - Port time gating operational gate list length register */
/*! @{ */

#define SW_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH_MASK (0xFFFFU)
#define SW_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH_SHIFT (0U)
#define SW_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH_WIDTH (16U)
#define SW_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH(x) (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH_SHIFT)) & SW_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH_MASK)
/*! @} */

/*! @name PTGSHAR - Port time gate scheduling hold advance register */
/*! @{ */

#define SW_PORT_PTGSHAR_HOLDADVANCE_MASK         (0xFFFFU)
#define SW_PORT_PTGSHAR_HOLDADVANCE_SHIFT        (0U)
#define SW_PORT_PTGSHAR_HOLDADVANCE_WIDTH        (16U)
#define SW_PORT_PTGSHAR_HOLDADVANCE(x)           (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTGSHAR_HOLDADVANCE_SHIFT)) & SW_PORT_PTGSHAR_HOLDADVANCE_MASK)
/*! @} */

/*! @name PTGSRAR - Port time gate scheduling release advance register */
/*! @{ */

#define SW_PORT_PTGSRAR_RELEASEADVANCE_MASK      (0xFFFFU)
#define SW_PORT_PTGSRAR_RELEASEADVANCE_SHIFT     (0U)
#define SW_PORT_PTGSRAR_RELEASEADVANCE_WIDTH     (16U)
#define SW_PORT_PTGSRAR_RELEASEADVANCE(x)        (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTGSRAR_RELEASEADVANCE_SHIFT)) & SW_PORT_PTGSRAR_RELEASEADVANCE_MASK)
/*! @} */

/*! @name PTGSHCR - Port time gate scheduling hold configuration register */
/*! @{ */

#define SW_PORT_PTGSHCR_HOLD_SKEW_MASK           (0xFFFFFU)
#define SW_PORT_PTGSHCR_HOLD_SKEW_SHIFT          (0U)
#define SW_PORT_PTGSHCR_HOLD_SKEW_WIDTH          (20U)
#define SW_PORT_PTGSHCR_HOLD_SKEW(x)             (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTGSHCR_HOLD_SKEW_SHIFT)) & SW_PORT_PTGSHCR_HOLD_SKEW_MASK)
/*! @} */

/*! @name PFPCR - Port frame preemption configuration register */
/*! @{ */

#define SW_PORT_PFPCR_FPE_TC0_MASK               (0x1U)
#define SW_PORT_PFPCR_FPE_TC0_SHIFT              (0U)
#define SW_PORT_PFPCR_FPE_TC0_WIDTH              (1U)
#define SW_PORT_PFPCR_FPE_TC0(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PFPCR_FPE_TC0_SHIFT)) & SW_PORT_PFPCR_FPE_TC0_MASK)

#define SW_PORT_PFPCR_FPE_TC1_MASK               (0x2U)
#define SW_PORT_PFPCR_FPE_TC1_SHIFT              (1U)
#define SW_PORT_PFPCR_FPE_TC1_WIDTH              (1U)
#define SW_PORT_PFPCR_FPE_TC1(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PFPCR_FPE_TC1_SHIFT)) & SW_PORT_PFPCR_FPE_TC1_MASK)

#define SW_PORT_PFPCR_FPE_TC2_MASK               (0x4U)
#define SW_PORT_PFPCR_FPE_TC2_SHIFT              (2U)
#define SW_PORT_PFPCR_FPE_TC2_WIDTH              (1U)
#define SW_PORT_PFPCR_FPE_TC2(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PFPCR_FPE_TC2_SHIFT)) & SW_PORT_PFPCR_FPE_TC2_MASK)

#define SW_PORT_PFPCR_FPE_TC3_MASK               (0x8U)
#define SW_PORT_PFPCR_FPE_TC3_SHIFT              (3U)
#define SW_PORT_PFPCR_FPE_TC3_WIDTH              (1U)
#define SW_PORT_PFPCR_FPE_TC3(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PFPCR_FPE_TC3_SHIFT)) & SW_PORT_PFPCR_FPE_TC3_MASK)

#define SW_PORT_PFPCR_FPE_TC4_MASK               (0x10U)
#define SW_PORT_PFPCR_FPE_TC4_SHIFT              (4U)
#define SW_PORT_PFPCR_FPE_TC4_WIDTH              (1U)
#define SW_PORT_PFPCR_FPE_TC4(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PFPCR_FPE_TC4_SHIFT)) & SW_PORT_PFPCR_FPE_TC4_MASK)

#define SW_PORT_PFPCR_FPE_TC5_MASK               (0x20U)
#define SW_PORT_PFPCR_FPE_TC5_SHIFT              (5U)
#define SW_PORT_PFPCR_FPE_TC5_WIDTH              (1U)
#define SW_PORT_PFPCR_FPE_TC5(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PFPCR_FPE_TC5_SHIFT)) & SW_PORT_PFPCR_FPE_TC5_MASK)

#define SW_PORT_PFPCR_FPE_TC6_MASK               (0x40U)
#define SW_PORT_PFPCR_FPE_TC6_SHIFT              (6U)
#define SW_PORT_PFPCR_FPE_TC6_WIDTH              (1U)
#define SW_PORT_PFPCR_FPE_TC6(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PFPCR_FPE_TC6_SHIFT)) & SW_PORT_PFPCR_FPE_TC6_MASK)

#define SW_PORT_PFPCR_FPE_TC7_MASK               (0x80U)
#define SW_PORT_PFPCR_FPE_TC7_SHIFT              (7U)
#define SW_PORT_PFPCR_FPE_TC7_WIDTH              (1U)
#define SW_PORT_PFPCR_FPE_TC7(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PFPCR_FPE_TC7_SHIFT)) & SW_PORT_PFPCR_FPE_TC7_MASK)
/*! @} */

/*! @name PDGSR - Port default gate state register */
/*! @{ */

