zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_PORT.h
#define SW_PORT_PDGSR_DGS_TC0_MASK               (0x1U)
#define SW_PORT_PDGSR_DGS_TC0_SHIFT              (0U)
#define SW_PORT_PDGSR_DGS_TC0_WIDTH              (1U)
#define SW_PORT_PDGSR_DGS_TC0(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PDGSR_DGS_TC0_SHIFT)) & SW_PORT_PDGSR_DGS_TC0_MASK)

#define SW_PORT_PDGSR_DGS_TC1_MASK               (0x2U)
#define SW_PORT_PDGSR_DGS_TC1_SHIFT              (1U)
#define SW_PORT_PDGSR_DGS_TC1_WIDTH              (1U)
#define SW_PORT_PDGSR_DGS_TC1(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PDGSR_DGS_TC1_SHIFT)) & SW_PORT_PDGSR_DGS_TC1_MASK)

#define SW_PORT_PDGSR_DGS_TC2_MASK               (0x4U)
#define SW_PORT_PDGSR_DGS_TC2_SHIFT              (2U)
#define SW_PORT_PDGSR_DGS_TC2_WIDTH              (1U)
#define SW_PORT_PDGSR_DGS_TC2(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PDGSR_DGS_TC2_SHIFT)) & SW_PORT_PDGSR_DGS_TC2_MASK)

#define SW_PORT_PDGSR_DGS_TC3_MASK               (0x8U)
#define SW_PORT_PDGSR_DGS_TC3_SHIFT              (3U)
#define SW_PORT_PDGSR_DGS_TC3_WIDTH              (1U)
#define SW_PORT_PDGSR_DGS_TC3(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PDGSR_DGS_TC3_SHIFT)) & SW_PORT_PDGSR_DGS_TC3_MASK)

#define SW_PORT_PDGSR_DGS_TC4_MASK               (0x10U)
#define SW_PORT_PDGSR_DGS_TC4_SHIFT              (4U)
#define SW_PORT_PDGSR_DGS_TC4_WIDTH              (1U)
#define SW_PORT_PDGSR_DGS_TC4(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PDGSR_DGS_TC4_SHIFT)) & SW_PORT_PDGSR_DGS_TC4_MASK)

#define SW_PORT_PDGSR_DGS_TC5_MASK               (0x20U)
#define SW_PORT_PDGSR_DGS_TC5_SHIFT              (5U)
#define SW_PORT_PDGSR_DGS_TC5_WIDTH              (1U)
#define SW_PORT_PDGSR_DGS_TC5(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PDGSR_DGS_TC5_SHIFT)) & SW_PORT_PDGSR_DGS_TC5_MASK)

#define SW_PORT_PDGSR_DGS_TC6_MASK               (0x40U)
#define SW_PORT_PDGSR_DGS_TC6_SHIFT              (6U)
#define SW_PORT_PDGSR_DGS_TC6_WIDTH              (1U)
#define SW_PORT_PDGSR_DGS_TC6(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PDGSR_DGS_TC6_SHIFT)) & SW_PORT_PDGSR_DGS_TC6_MASK)

#define SW_PORT_PDGSR_DGS_TC7_MASK               (0x80U)
#define SW_PORT_PDGSR_DGS_TC7_SHIFT              (7U)
#define SW_PORT_PDGSR_DGS_TC7_WIDTH              (1U)
#define SW_PORT_PDGSR_DGS_TC7(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PDGSR_DGS_TC7_SHIFT)) & SW_PORT_PDGSR_DGS_TC7_MASK)
/*! @} */

/*! @name PRXDCR - Port Rx discard count register */
/*! @{ */

#define SW_PORT_PRXDCR_COUNT_MASK                (0xFFFFFFFFU)
#define SW_PORT_PRXDCR_COUNT_SHIFT               (0U)
#define SW_PORT_PRXDCR_COUNT_WIDTH               (32U)
#define SW_PORT_PRXDCR_COUNT(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCR_COUNT_SHIFT)) & SW_PORT_PRXDCR_COUNT_MASK)
/*! @} */

/*! @name PRXDCRR0 - Port Rx discard count reason register 0 */
/*! @{ */

#define SW_PORT_PRXDCRR0_PCDR_MASK               (0x1U)
#define SW_PORT_PRXDCRR0_PCDR_SHIFT              (0U)
#define SW_PORT_PRXDCRR0_PCDR_WIDTH              (1U)
#define SW_PORT_PRXDCRR0_PCDR(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_PCDR_SHIFT)) & SW_PORT_PRXDCRR0_PCDR_MASK)

#define SW_PORT_PRXDCRR0_SMREDR_MASK             (0x2U)
#define SW_PORT_PRXDCRR0_SMREDR_SHIFT            (1U)
#define SW_PORT_PRXDCRR0_SMREDR_WIDTH            (1U)
#define SW_PORT_PRXDCRR0_SMREDR(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_SMREDR_SHIFT)) & SW_PORT_PRXDCRR0_SMREDR_MASK)

#define SW_PORT_PRXDCRR0_RXDISDR_MASK            (0x4U)
#define SW_PORT_PRXDCRR0_RXDISDR_SHIFT           (2U)
#define SW_PORT_PRXDCRR0_RXDISDR_WIDTH           (1U)
#define SW_PORT_PRXDCRR0_RXDISDR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_RXDISDR_SHIFT)) & SW_PORT_PRXDCRR0_RXDISDR_MASK)

#define SW_PORT_PRXDCRR0_IPFDR_MASK              (0x8U)
#define SW_PORT_PRXDCRR0_IPFDR_SHIFT             (3U)
#define SW_PORT_PRXDCRR0_IPFDR_WIDTH             (1U)
#define SW_PORT_PRXDCRR0_IPFDR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_IPFDR_SHIFT)) & SW_PORT_PRXDCRR0_IPFDR_MASK)

#define SW_PORT_PRXDCRR0_RPDR_MASK               (0x10U)
#define SW_PORT_PRXDCRR0_RPDR_SHIFT              (4U)
#define SW_PORT_PRXDCRR0_RPDR_WIDTH              (1U)
#define SW_PORT_PRXDCRR0_RPDR(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_RPDR_SHIFT)) & SW_PORT_PRXDCRR0_RPDR_MASK)

#define SW_PORT_PRXDCRR0_ISFDR_MASK              (0x20U)
#define SW_PORT_PRXDCRR0_ISFDR_SHIFT             (5U)
#define SW_PORT_PRXDCRR0_ISFDR_WIDTH             (1U)
#define SW_PORT_PRXDCRR0_ISFDR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_ISFDR_SHIFT)) & SW_PORT_PRXDCRR0_ISFDR_MASK)

#define SW_PORT_PRXDCRR0_SGCDR_MASK              (0x40U)
#define SW_PORT_PRXDCRR0_SGCDR_SHIFT             (6U)
#define SW_PORT_PRXDCRR0_SGCDR_WIDTH             (1U)
#define SW_PORT_PRXDCRR0_SGCDR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_SGCDR_SHIFT)) & SW_PORT_PRXDCRR0_SGCDR_MASK)

#define SW_PORT_PRXDCRR0_SGOEDR_MASK             (0x80U)
#define SW_PORT_PRXDCRR0_SGOEDR_SHIFT            (7U)
#define SW_PORT_PRXDCRR0_SGOEDR_WIDTH            (1U)
#define SW_PORT_PRXDCRR0_SGOEDR(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_SGOEDR_SHIFT)) & SW_PORT_PRXDCRR0_SGOEDR_MASK)

#define SW_PORT_PRXDCRR0_MSDUEDR_MASK            (0x100U)
#define SW_PORT_PRXDCRR0_MSDUEDR_SHIFT           (8U)
#define SW_PORT_PRXDCRR0_MSDUEDR_WIDTH           (1U)
#define SW_PORT_PRXDCRR0_MSDUEDR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_MSDUEDR_SHIFT)) & SW_PORT_PRXDCRR0_MSDUEDR_MASK)

#define SW_PORT_PRXDCRR0_FMMEDR_MASK             (0x200U)
#define SW_PORT_PRXDCRR0_FMMEDR_SHIFT            (9U)
#define SW_PORT_PRXDCRR0_FMMEDR_WIDTH            (1U)
#define SW_PORT_PRXDCRR0_FMMEDR(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_FMMEDR_SHIFT)) & SW_PORT_PRXDCRR0_FMMEDR_MASK)

