zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_PORT.h
#define SW_PORT_PRXDCRR0_CMDR_MASK               (0x400U)
#define SW_PORT_PRXDCRR0_CMDR_SHIFT              (10U)
#define SW_PORT_PRXDCRR0_CMDR_WIDTH              (1U)
#define SW_PORT_PRXDCRR0_CMDR(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_CMDR_SHIFT)) & SW_PORT_PRXDCRR0_CMDR_MASK)

#define SW_PORT_PRXDCRR0_ITEDR_MASK              (0x800U)
#define SW_PORT_PRXDCRR0_ITEDR_SHIFT             (11U)
#define SW_PORT_PRXDCRR0_ITEDR_WIDTH             (1U)
#define SW_PORT_PRXDCRR0_ITEDR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_ITEDR_SHIFT)) & SW_PORT_PRXDCRR0_ITEDR_MASK)

#define SW_PORT_PRXDCRR0_ECCEDR_MASK             (0x1000U)
#define SW_PORT_PRXDCRR0_ECCEDR_SHIFT            (12U)
#define SW_PORT_PRXDCRR0_ECCEDR_WIDTH            (1U)
#define SW_PORT_PRXDCRR0_ECCEDR(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_ECCEDR_SHIFT)) & SW_PORT_PRXDCRR0_ECCEDR_MASK)

#define SW_PORT_PRXDCRR0_L2DOSDR_MASK            (0x4000U)
#define SW_PORT_PRXDCRR0_L2DOSDR_SHIFT           (14U)
#define SW_PORT_PRXDCRR0_L2DOSDR_WIDTH           (1U)
#define SW_PORT_PRXDCRR0_L2DOSDR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_L2DOSDR_SHIFT)) & SW_PORT_PRXDCRR0_L2DOSDR_MASK)

#define SW_PORT_PRXDCRR0_L3DOSDR_MASK            (0x8000U)
#define SW_PORT_PRXDCRR0_L3DOSDR_SHIFT           (15U)
#define SW_PORT_PRXDCRR0_L3DOSDR_WIDTH           (1U)
#define SW_PORT_PRXDCRR0_L3DOSDR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_L3DOSDR_SHIFT)) & SW_PORT_PRXDCRR0_L3DOSDR_MASK)

#define SW_PORT_PRXDCRR0_PEDR_MASK               (0x10000U)
#define SW_PORT_PRXDCRR0_PEDR_SHIFT              (16U)
#define SW_PORT_PRXDCRR0_PEDR_WIDTH              (1U)
#define SW_PORT_PRXDCRR0_PEDR(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_PEDR_SHIFT)) & SW_PORT_PRXDCRR0_PEDR_MASK)

#define SW_PORT_PRXDCRR0_NODESTDR_MASK           (0x20000U)
#define SW_PORT_PRXDCRR0_NODESTDR_SHIFT          (17U)
#define SW_PORT_PRXDCRR0_NODESTDR_WIDTH          (1U)
#define SW_PORT_PRXDCRR0_NODESTDR(x)             (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_NODESTDR_SHIFT)) & SW_PORT_PRXDCRR0_NODESTDR_MASK)

#define SW_PORT_PRXDCRR0_NSTPDR_MASK             (0x40000U)
#define SW_PORT_PRXDCRR0_NSTPDR_SHIFT            (18U)
#define SW_PORT_PRXDCRR0_NSTPDR_WIDTH            (1U)
#define SW_PORT_PRXDCRR0_NSTPDR(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_NSTPDR_SHIFT)) & SW_PORT_PRXDCRR0_NSTPDR_MASK)

#define SW_PORT_PRXDCRR0_NSTDDR_MASK             (0x80000U)
#define SW_PORT_PRXDCRR0_NSTDDR_SHIFT            (19U)
#define SW_PORT_PRXDCRR0_NSTDDR_WIDTH            (1U)
#define SW_PORT_PRXDCRR0_NSTDDR(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_NSTDDR_SHIFT)) & SW_PORT_PRXDCRR0_NSTDDR_MASK)

#define SW_PORT_PRXDCRR0_ASIDR_MASK              (0x100000U)
#define SW_PORT_PRXDCRR0_ASIDR_SHIFT             (20U)
#define SW_PORT_PRXDCRR0_ASIDR_WIDTH             (1U)
#define SW_PORT_PRXDCRR0_ASIDR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR0_ASIDR_SHIFT)) & SW_PORT_PRXDCRR0_ASIDR_MASK)
/*! @} */

/*! @name PRXDCRR1 - Port Rx discard count reason register 1 */
/*! @{ */

#define SW_PORT_PRXDCRR1_ENTRYID_MASK            (0xFFFFU)
#define SW_PORT_PRXDCRR1_ENTRYID_SHIFT           (0U)
#define SW_PORT_PRXDCRR1_ENTRYID_WIDTH           (16U)
#define SW_PORT_PRXDCRR1_ENTRYID(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR1_ENTRYID_SHIFT)) & SW_PORT_PRXDCRR1_ENTRYID_MASK)

#define SW_PORT_PRXDCRR1_TT_MASK                 (0xF0000000U)
#define SW_PORT_PRXDCRR1_TT_SHIFT                (28U)
#define SW_PORT_PRXDCRR1_TT_WIDTH                (4U)
#define SW_PORT_PRXDCRR1_TT(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PRXDCRR1_TT_SHIFT)) & SW_PORT_PRXDCRR1_TT_MASK)
/*! @} */

/*! @name PTXDCR - Port Tx discard count register */
/*! @{ */

#define SW_PORT_PTXDCR_COUNT_MASK                (0xFFFFFFFFU)
#define SW_PORT_PTXDCR_COUNT_SHIFT               (0U)
#define SW_PORT_PTXDCR_COUNT_WIDTH               (32U)
#define SW_PORT_PTXDCR_COUNT(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCR_COUNT_SHIFT)) & SW_PORT_PTXDCR_COUNT_MASK)
/*! @} */

/*! @name PTXDCRR0 - Port Tx discard count reason register 0 */
/*! @{ */

#define SW_PORT_PTXDCRR0_TXDISDR_MASK            (0x1U)
#define SW_PORT_PTXDCRR0_TXDISDR_SHIFT           (0U)
#define SW_PORT_PTXDCRR0_TXDISDR_WIDTH           (1U)
#define SW_PORT_PTXDCRR0_TXDISDR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR0_TXDISDR_SHIFT)) & SW_PORT_PTXDCRR0_TXDISDR_MASK)

#define SW_PORT_PTXDCRR0_ECCEDR_MASK             (0x2U)
#define SW_PORT_PTXDCRR0_ECCEDR_SHIFT            (1U)
#define SW_PORT_PTXDCRR0_ECCEDR_WIDTH            (1U)
#define SW_PORT_PTXDCRR0_ECCEDR(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR0_ECCEDR_SHIFT)) & SW_PORT_PTXDCRR0_ECCEDR_MASK)

#define SW_PORT_PTXDCRR0_PEDR_MASK               (0x4U)
#define SW_PORT_PTXDCRR0_PEDR_SHIFT              (2U)
#define SW_PORT_PTXDCRR0_PEDR_WIDTH              (1U)
#define SW_PORT_PTXDCRR0_PEDR(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR0_PEDR_SHIFT)) & SW_PORT_PTXDCRR0_PEDR_MASK)

#define SW_PORT_PTXDCRR0_TGSFTLDR_MASK           (0x10U)
#define SW_PORT_PTXDCRR0_TGSFTLDR_SHIFT          (4U)
#define SW_PORT_PTXDCRR0_TGSFTLDR_WIDTH          (1U)
#define SW_PORT_PTXDCRR0_TGSFTLDR(x)             (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR0_TGSFTLDR_SHIFT)) & SW_PORT_PTXDCRR0_TGSFTLDR_MASK)

#define SW_PORT_PTXDCRR0_FMMDR_MASK              (0x20U)
#define SW_PORT_PTXDCRR0_FMMDR_SHIFT             (5U)
#define SW_PORT_PTXDCRR0_FMMDR_WIDTH             (1U)
#define SW_PORT_PTXDCRR0_FMMDR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR0_FMMDR_SHIFT)) & SW_PORT_PTXDCRR0_FMMDR_MASK)

#define SW_PORT_PTXDCRR0_TXDISEDR_MASK           (0x40U)
#define SW_PORT_PTXDCRR0_TXDISEDR_SHIFT          (6U)
#define SW_PORT_PTXDCRR0_TXDISEDR_WIDTH          (1U)
#define SW_PORT_PTXDCRR0_TXDISEDR(x)             (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR0_TXDISEDR_SHIFT)) & SW_PORT_PTXDCRR0_TXDISEDR_MASK)

#define SW_PORT_PTXDCRR0_MSDUEDR_MASK            (0x80U)
#define SW_PORT_PTXDCRR0_MSDUEDR_SHIFT           (7U)
#define SW_PORT_PTXDCRR0_MSDUEDR_WIDTH           (1U)
#define SW_PORT_PTXDCRR0_MSDUEDR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR0_MSDUEDR_SHIFT)) & SW_PORT_PTXDCRR0_MSDUEDR_MASK)

#define SW_PORT_PTXDCRR0_QCONGDR_MASK            (0x100U)
#define SW_PORT_PTXDCRR0_QCONGDR_SHIFT           (8U)
#define SW_PORT_PTXDCRR0_QCONGDR_WIDTH           (1U)
#define SW_PORT_PTXDCRR0_QCONGDR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR0_QCONGDR_SHIFT)) & SW_PORT_PTXDCRR0_QCONGDR_MASK)

#define SW_PORT_PTXDCRR0_ITEDR_MASK              (0x200U)
#define SW_PORT_PTXDCRR0_ITEDR_SHIFT             (9U)
#define SW_PORT_PTXDCRR0_ITEDR_WIDTH             (1U)
#define SW_PORT_PTXDCRR0_ITEDR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR0_ITEDR_SHIFT)) & SW_PORT_PTXDCRR0_ITEDR_MASK)

