zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_PORT.h
#define SW_PORT_PTXDCRR0_INVEQDR_MASK            (0x400U)
#define SW_PORT_PTXDCRR0_INVEQDR_SHIFT           (10U)
#define SW_PORT_PTXDCRR0_INVEQDR_WIDTH           (1U)
#define SW_PORT_PTXDCRR0_INVEQDR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR0_INVEQDR_SHIFT)) & SW_PORT_PTXDCRR0_INVEQDR_MASK)

#define SW_PORT_PTXDCRR0_SQRTNSQDR_MASK          (0x800U)
#define SW_PORT_PTXDCRR0_SQRTNSQDR_SHIFT         (11U)
#define SW_PORT_PTXDCRR0_SQRTNSQDR_WIDTH         (1U)
#define SW_PORT_PTXDCRR0_SQRTNSQDR(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR0_SQRTNSQDR_SHIFT)) & SW_PORT_PTXDCRR0_SQRTNSQDR_MASK)

#define SW_PORT_PTXDCRR0_SQRRDR_MASK             (0x2000U)
#define SW_PORT_PTXDCRR0_SQRRDR_SHIFT            (13U)
#define SW_PORT_PTXDCRR0_SQRRDR_WIDTH            (1U)
#define SW_PORT_PTXDCRR0_SQRRDR(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR0_SQRRDR_SHIFT)) & SW_PORT_PTXDCRR0_SQRRDR_MASK)

#define SW_PORT_PTXDCRR0_SQRDDR_MASK             (0x4000U)
#define SW_PORT_PTXDCRR0_SQRDDR_SHIFT            (14U)
#define SW_PORT_PTXDCRR0_SQRDDR_WIDTH            (1U)
#define SW_PORT_PTXDCRR0_SQRDDR(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR0_SQRDDR_SHIFT)) & SW_PORT_PTXDCRR0_SQRDDR_MASK)

#define SW_PORT_PTXDCRR0_SMREDR_MASK             (0x8000U)
#define SW_PORT_PTXDCRR0_SMREDR_SHIFT            (15U)
#define SW_PORT_PTXDCRR0_SMREDR_WIDTH            (1U)
#define SW_PORT_PTXDCRR0_SMREDR(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR0_SMREDR_SHIFT)) & SW_PORT_PTXDCRR0_SMREDR_MASK)
/*! @} */

/*! @name PTXDCRR1 - Port Tx discard count reason register 1 */
/*! @{ */

#define SW_PORT_PTXDCRR1_ENTRYID_MASK            (0xFFFFU)
#define SW_PORT_PTXDCRR1_ENTRYID_SHIFT           (0U)
#define SW_PORT_PTXDCRR1_ENTRYID_WIDTH           (16U)
#define SW_PORT_PTXDCRR1_ENTRYID(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR1_ENTRYID_SHIFT)) & SW_PORT_PTXDCRR1_ENTRYID_MASK)

#define SW_PORT_PTXDCRR1_TT_MASK                 (0xF0000000U)
#define SW_PORT_PTXDCRR1_TT_SHIFT                (28U)
#define SW_PORT_PTXDCRR1_TT_WIDTH                (4U)
#define SW_PORT_PTXDCRR1_TT(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTXDCRR1_TT_SHIFT)) & SW_PORT_PTXDCRR1_TT_MASK)
/*! @} */

/*! @name PTGSTCSR - Port time gate scheduling traffic class 0 status register..Port time gate scheduling traffic class 7 status register */
/*! @{ */

#define SW_PORT_PTGSTCSR_LH_STATE_MASK           (0x10000U)
#define SW_PORT_PTGSTCSR_LH_STATE_SHIFT          (16U)
#define SW_PORT_PTGSTCSR_LH_STATE_WIDTH          (1U)
#define SW_PORT_PTGSTCSR_LH_STATE(x)             (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTGSTCSR_LH_STATE_SHIFT)) & SW_PORT_PTGSTCSR_LH_STATE_MASK)
/*! @} */

/*! @name PTGSTCOCR - Port time gate scheduling traffic class 0 overrun counter register..Port time gate scheduling traffic class 7 overrun counter register */
/*! @{ */

#define SW_PORT_PTGSTCOCR_TX_OVERRUN_MASK        (0xFU)
#define SW_PORT_PTGSTCOCR_TX_OVERRUN_SHIFT       (0U)
#define SW_PORT_PTGSTCOCR_TX_OVERRUN_WIDTH       (4U)
#define SW_PORT_PTGSTCOCR_TX_OVERRUN(x)          (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTGSTCOCR_TX_OVERRUN_SHIFT)) & SW_PORT_PTGSTCOCR_TX_OVERRUN_MASK)
/*! @} */

/*! @name PTCTMSDUR - Port traffic class 0 transmit maximum SDU register..Port traffic class 7 transmit maximum SDU register */
/*! @{ */

#define SW_PORT_PTCTMSDUR_MAXSDU_MASK            (0xFFFFU)
#define SW_PORT_PTCTMSDUR_MAXSDU_SHIFT           (0U)
#define SW_PORT_PTCTMSDUR_MAXSDU_WIDTH           (16U)
#define SW_PORT_PTCTMSDUR_MAXSDU(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTCTMSDUR_MAXSDU_SHIFT)) & SW_PORT_PTCTMSDUR_MAXSDU_MASK)

#define SW_PORT_PTCTMSDUR_SDU_TYPE_MASK          (0x30000U)
#define SW_PORT_PTCTMSDUR_SDU_TYPE_SHIFT         (16U)
#define SW_PORT_PTCTMSDUR_SDU_TYPE_WIDTH         (2U)
#define SW_PORT_PTCTMSDUR_SDU_TYPE(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTCTMSDUR_SDU_TYPE_SHIFT)) & SW_PORT_PTCTMSDUR_SDU_TYPE_MASK)

#define SW_PORT_PTCTMSDUR_SF_MAXSDU_DIS_MASK     (0x1000000U)
#define SW_PORT_PTCTMSDUR_SF_MAXSDU_DIS_SHIFT    (24U)
#define SW_PORT_PTCTMSDUR_SF_MAXSDU_DIS_WIDTH    (1U)
#define SW_PORT_PTCTMSDUR_SF_MAXSDU_DIS(x)       (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTCTMSDUR_SF_MAXSDU_DIS_SHIFT)) & SW_PORT_PTCTMSDUR_SF_MAXSDU_DIS_MASK)
/*! @} */

/*! @name PTCCBSR0 - Port transmit traffic class 0 credit based shaper register 0..Port transmit traffic class 7 credit based shaper register 0 */
/*! @{ */

#define SW_PORT_PTCCBSR0_BW_MASK                 (0x7FU)
#define SW_PORT_PTCCBSR0_BW_SHIFT                (0U)
#define SW_PORT_PTCCBSR0_BW_WIDTH                (7U)
#define SW_PORT_PTCCBSR0_BW(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTCCBSR0_BW_SHIFT)) & SW_PORT_PTCCBSR0_BW_MASK)

#define SW_PORT_PTCCBSR0_FRACT_MASK              (0xF0000U)
#define SW_PORT_PTCCBSR0_FRACT_SHIFT             (16U)
#define SW_PORT_PTCCBSR0_FRACT_WIDTH             (4U)
#define SW_PORT_PTCCBSR0_FRACT(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTCCBSR0_FRACT_SHIFT)) & SW_PORT_PTCCBSR0_FRACT_MASK)

#define SW_PORT_PTCCBSR0_CBSE_MASK               (0x80000000U)
#define SW_PORT_PTCCBSR0_CBSE_SHIFT              (31U)
#define SW_PORT_PTCCBSR0_CBSE_WIDTH              (1U)
#define SW_PORT_PTCCBSR0_CBSE(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTCCBSR0_CBSE_SHIFT)) & SW_PORT_PTCCBSR0_CBSE_MASK)
/*! @} */

/*! @name PTCCBSR1 - Port traffic class 0 credit based shaper register 1..Port traffic class 7 credit based shaper register 1 */
/*! @{ */

#define SW_PORT_PTCCBSR1_HI_CREDIT_MASK          (0xFFFFFFFFU)
#define SW_PORT_PTCCBSR1_HI_CREDIT_SHIFT         (0U)
#define SW_PORT_PTCCBSR1_HI_CREDIT_WIDTH         (32U)
#define SW_PORT_PTCCBSR1_HI_CREDIT(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTCCBSR1_HI_CREDIT_SHIFT)) & SW_PORT_PTCCBSR1_HI_CREDIT_MASK)
/*! @} */

/*! @name PTCCBSR2 - Port transmit traffic class 0 credit based shaper register 2..Port transmit traffic class 7 credit based shaper register 2 */
/*! @{ */

#define SW_PORT_PTCCBSR2_IDLESLOPE_MASK          (0x7FFFFFFU)
#define SW_PORT_PTCCBSR2_IDLESLOPE_SHIFT         (0U)
#define SW_PORT_PTCCBSR2_IDLESLOPE_WIDTH         (27U)
#define SW_PORT_PTCCBSR2_IDLESLOPE(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTCCBSR2_IDLESLOPE_SHIFT)) & SW_PORT_PTCCBSR2_IDLESLOPE_MASK)

#define SW_PORT_PTCCBSR2_CBSE_MASK               (0x80000000U)
#define SW_PORT_PTCCBSR2_CBSE_SHIFT              (31U)
#define SW_PORT_PTCCBSR2_CBSE_WIDTH              (1U)
#define SW_PORT_PTCCBSR2_CBSE(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTCCBSR2_CBSE_SHIFT)) & SW_PORT_PTCCBSR2_CBSE_MASK)
/*! @} */

