zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_PORT.h
/*! @name PBPMCR0 - Port buffer pool mapping configuration register 0 */
/*! @{ */

#define SW_PORT_PBPMCR0_IPV0_INDEX_MASK          (0xFFU)
#define SW_PORT_PBPMCR0_IPV0_INDEX_SHIFT         (0U)
#define SW_PORT_PBPMCR0_IPV0_INDEX_WIDTH         (8U)
#define SW_PORT_PBPMCR0_IPV0_INDEX(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_PBPMCR0_IPV0_INDEX_SHIFT)) & SW_PORT_PBPMCR0_IPV0_INDEX_MASK)

#define SW_PORT_PBPMCR0_IPV1_INDEX_MASK          (0xFF00U)
#define SW_PORT_PBPMCR0_IPV1_INDEX_SHIFT         (8U)
#define SW_PORT_PBPMCR0_IPV1_INDEX_WIDTH         (8U)
#define SW_PORT_PBPMCR0_IPV1_INDEX(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_PBPMCR0_IPV1_INDEX_SHIFT)) & SW_PORT_PBPMCR0_IPV1_INDEX_MASK)

#define SW_PORT_PBPMCR0_IPV2_INDEX_MASK          (0xFF0000U)
#define SW_PORT_PBPMCR0_IPV2_INDEX_SHIFT         (16U)
#define SW_PORT_PBPMCR0_IPV2_INDEX_WIDTH         (8U)
#define SW_PORT_PBPMCR0_IPV2_INDEX(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_PBPMCR0_IPV2_INDEX_SHIFT)) & SW_PORT_PBPMCR0_IPV2_INDEX_MASK)

#define SW_PORT_PBPMCR0_IPV3_INDEX_MASK          (0xFF000000U)
#define SW_PORT_PBPMCR0_IPV3_INDEX_SHIFT         (24U)
#define SW_PORT_PBPMCR0_IPV3_INDEX_WIDTH         (8U)
#define SW_PORT_PBPMCR0_IPV3_INDEX(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_PBPMCR0_IPV3_INDEX_SHIFT)) & SW_PORT_PBPMCR0_IPV3_INDEX_MASK)
/*! @} */

/*! @name PBPMCR1 - Port buffer pool mapping configuration register 1 */
/*! @{ */

#define SW_PORT_PBPMCR1_IPV4_INDEX_MASK          (0xFFU)
#define SW_PORT_PBPMCR1_IPV4_INDEX_SHIFT         (0U)
#define SW_PORT_PBPMCR1_IPV4_INDEX_WIDTH         (8U)
#define SW_PORT_PBPMCR1_IPV4_INDEX(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_PBPMCR1_IPV4_INDEX_SHIFT)) & SW_PORT_PBPMCR1_IPV4_INDEX_MASK)

#define SW_PORT_PBPMCR1_IPV5_INDEX_MASK          (0xFF00U)
#define SW_PORT_PBPMCR1_IPV5_INDEX_SHIFT         (8U)
#define SW_PORT_PBPMCR1_IPV5_INDEX_WIDTH         (8U)
#define SW_PORT_PBPMCR1_IPV5_INDEX(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_PBPMCR1_IPV5_INDEX_SHIFT)) & SW_PORT_PBPMCR1_IPV5_INDEX_MASK)

#define SW_PORT_PBPMCR1_IPV6_INDEX_MASK          (0xFF0000U)
#define SW_PORT_PBPMCR1_IPV6_INDEX_SHIFT         (16U)
#define SW_PORT_PBPMCR1_IPV6_INDEX_WIDTH         (8U)
#define SW_PORT_PBPMCR1_IPV6_INDEX(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_PBPMCR1_IPV6_INDEX_SHIFT)) & SW_PORT_PBPMCR1_IPV6_INDEX_MASK)

#define SW_PORT_PBPMCR1_IPV7_INDEX_MASK          (0xFF000000U)
#define SW_PORT_PBPMCR1_IPV7_INDEX_SHIFT         (24U)
#define SW_PORT_PBPMCR1_IPV7_INDEX_WIDTH         (8U)
#define SW_PORT_PBPMCR1_IPV7_INDEX(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_PBPMCR1_IPV7_INDEX_SHIFT)) & SW_PORT_PBPMCR1_IPV7_INDEX_MASK)
/*! @} */

/*! @name PGCR - Port group configuration register */
/*! @{ */

#define SW_PORT_PGCR_PGID_MASK                   (0x7U)
#define SW_PORT_PGCR_PGID_SHIFT                  (0U)
#define SW_PORT_PGCR_PGID_WIDTH                  (3U)
#define SW_PORT_PGCR_PGID(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PGCR_PGID_SHIFT)) & SW_PORT_PGCR_PGID_MASK)
/*! @} */

/*! @name PPCPDEIMR - Port PCP DEI mapping register */
/*! @{ */

#define SW_PORT_PPCPDEIMR_IPCPMP_MASK            (0xFU)
#define SW_PORT_PPCPDEIMR_IPCPMP_SHIFT           (0U)
#define SW_PORT_PPCPDEIMR_IPCPMP_WIDTH           (4U)
#define SW_PORT_PPCPDEIMR_IPCPMP(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCPDEIMR_IPCPMP_SHIFT)) & SW_PORT_PPCPDEIMR_IPCPMP_MASK)

#define SW_PORT_PPCPDEIMR_IPCPMPV_MASK           (0x80U)
#define SW_PORT_PPCPDEIMR_IPCPMPV_SHIFT          (7U)
#define SW_PORT_PPCPDEIMR_IPCPMPV_WIDTH          (1U)
#define SW_PORT_PPCPDEIMR_IPCPMPV(x)             (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCPDEIMR_IPCPMPV_SHIFT)) & SW_PORT_PPCPDEIMR_IPCPMPV_MASK)

#define SW_PORT_PPCPDEIMR_EPCPMP_MASK            (0xF00U)
#define SW_PORT_PPCPDEIMR_EPCPMP_SHIFT           (8U)
#define SW_PORT_PPCPDEIMR_EPCPMP_WIDTH           (4U)
#define SW_PORT_PPCPDEIMR_EPCPMP(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCPDEIMR_EPCPMP_SHIFT)) & SW_PORT_PPCPDEIMR_EPCPMP_MASK)

#define SW_PORT_PPCPDEIMR_EPCPMPV_MASK           (0x8000U)
#define SW_PORT_PPCPDEIMR_EPCPMPV_SHIFT          (15U)
#define SW_PORT_PPCPDEIMR_EPCPMPV_WIDTH          (1U)
#define SW_PORT_PPCPDEIMR_EPCPMPV(x)             (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCPDEIMR_EPCPMPV_SHIFT)) & SW_PORT_PPCPDEIMR_EPCPMPV_MASK)

#define SW_PORT_PPCPDEIMR_DR0DEI_MASK            (0x10000U)
#define SW_PORT_PPCPDEIMR_DR0DEI_SHIFT           (16U)
#define SW_PORT_PPCPDEIMR_DR0DEI_WIDTH           (1U)
#define SW_PORT_PPCPDEIMR_DR0DEI(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCPDEIMR_DR0DEI_SHIFT)) & SW_PORT_PPCPDEIMR_DR0DEI_MASK)

#define SW_PORT_PPCPDEIMR_DR1DEI_MASK            (0x20000U)
#define SW_PORT_PPCPDEIMR_DR1DEI_SHIFT           (17U)
#define SW_PORT_PPCPDEIMR_DR1DEI_WIDTH           (1U)
#define SW_PORT_PPCPDEIMR_DR1DEI(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCPDEIMR_DR1DEI_SHIFT)) & SW_PORT_PPCPDEIMR_DR1DEI_MASK)

#define SW_PORT_PPCPDEIMR_DR2DEI_MASK            (0x40000U)
#define SW_PORT_PPCPDEIMR_DR2DEI_SHIFT           (18U)
#define SW_PORT_PPCPDEIMR_DR2DEI_WIDTH           (1U)
#define SW_PORT_PPCPDEIMR_DR2DEI(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCPDEIMR_DR2DEI_SHIFT)) & SW_PORT_PPCPDEIMR_DR2DEI_MASK)

#define SW_PORT_PPCPDEIMR_DR3DEI_MASK            (0x80000U)
#define SW_PORT_PPCPDEIMR_DR3DEI_SHIFT           (19U)
#define SW_PORT_PPCPDEIMR_DR3DEI_WIDTH           (1U)
#define SW_PORT_PPCPDEIMR_DR3DEI(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCPDEIMR_DR3DEI_SHIFT)) & SW_PORT_PPCPDEIMR_DR3DEI_MASK)

#define SW_PORT_PPCPDEIMR_DRME_MASK              (0x100000U)
#define SW_PORT_PPCPDEIMR_DRME_SHIFT             (20U)
#define SW_PORT_PPCPDEIMR_DRME_WIDTH             (1U)
#define SW_PORT_PPCPDEIMR_DRME(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PPCPDEIMR_DRME_SHIFT)) & SW_PORT_PPCPDEIMR_DRME_MASK)
/*! @} */

/*! @name PMCR - Port mirror configuration register */
/*! @{ */

#define SW_PORT_PMCR_MIRE_MASK                   (0x1U)
#define SW_PORT_PMCR_MIRE_SHIFT                  (0U)
#define SW_PORT_PMCR_MIRE_WIDTH                  (1U)
#define SW_PORT_PMCR_MIRE(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCR_MIRE_SHIFT)) & SW_PORT_PMCR_MIRE_MASK)

#define SW_PORT_PMCR_DIR_MASK                    (0x10U)
#define SW_PORT_PMCR_DIR_SHIFT                   (4U)
#define SW_PORT_PMCR_DIR_WIDTH                   (1U)
#define SW_PORT_PMCR_DIR(x)                      (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCR_DIR_SHIFT)) & SW_PORT_PMCR_DIR_MASK)

#define SW_PORT_PMCR_MACM_MASK                   (0x300U)
#define SW_PORT_PMCR_MACM_SHIFT                  (8U)
#define SW_PORT_PMCR_MACM_WIDTH                  (2U)
#define SW_PORT_PMCR_MACM(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCR_MACM_SHIFT)) & SW_PORT_PMCR_MACM_MASK)

#define SW_PORT_PMCR_VIDM_MASK                   (0x3000U)
#define SW_PORT_PMCR_VIDM_SHIFT                  (12U)
#define SW_PORT_PMCR_VIDM_WIDTH                  (2U)
#define SW_PORT_PMCR_VIDM(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCR_VIDM_SHIFT)) & SW_PORT_PMCR_VIDM_MASK)

#define SW_PORT_PMCR_PCPM_MASK                   (0x10000U)
#define SW_PORT_PMCR_PCPM_SHIFT                  (16U)
#define SW_PORT_PMCR_PCPM_WIDTH                  (1U)
#define SW_PORT_PMCR_PCPM(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCR_PCPM_SHIFT)) & SW_PORT_PMCR_PCPM_MASK)
/*! @} */

