zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_PORT.h
/*! @name PMCR1 - Port mirror configuration register 1 */
/*! @{ */

#define SW_PORT_PMCR1_MAC_ADDR_MASK              (0xFFFFFFFFU)
#define SW_PORT_PMCR1_MAC_ADDR_SHIFT             (0U)
#define SW_PORT_PMCR1_MAC_ADDR_WIDTH             (32U)
#define SW_PORT_PMCR1_MAC_ADDR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCR1_MAC_ADDR_SHIFT)) & SW_PORT_PMCR1_MAC_ADDR_MASK)
/*! @} */

/*! @name PMCR2 - Port mirror configuration register 2 */
/*! @{ */

#define SW_PORT_PMCR2_MAC_ADDR_MASK              (0xFFFFU)
#define SW_PORT_PMCR2_MAC_ADDR_SHIFT             (0U)
#define SW_PORT_PMCR2_MAC_ADDR_WIDTH             (16U)
#define SW_PORT_PMCR2_MAC_ADDR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCR2_MAC_ADDR_SHIFT)) & SW_PORT_PMCR2_MAC_ADDR_MASK)

#define SW_PORT_PMCR2_VID_MASK                   (0xFFF0000U)
#define SW_PORT_PMCR2_VID_SHIFT                  (16U)
#define SW_PORT_PMCR2_VID_WIDTH                  (12U)
#define SW_PORT_PMCR2_VID(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCR2_VID_SHIFT)) & SW_PORT_PMCR2_VID_MASK)

#define SW_PORT_PMCR2_PCP_MASK                   (0x70000000U)
#define SW_PORT_PMCR2_PCP_SHIFT                  (28U)
#define SW_PORT_PMCR2_PCP_WIDTH                  (3U)
#define SW_PORT_PMCR2_PCP(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_PMCR2_PCP_SHIFT)) & SW_PORT_PMCR2_PCP_MASK)
/*! @} */

/*! @name PCTFCR - Port cut through forwarding configuration register */
/*! @{ */

#define SW_PORT_PCTFCR_ICTS_MASK                 (0x1U)
#define SW_PORT_PCTFCR_ICTS_SHIFT                (0U)
#define SW_PORT_PCTFCR_ICTS_WIDTH                (1U)
#define SW_PORT_PCTFCR_ICTS(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCTFCR_ICTS_SHIFT)) & SW_PORT_PCTFCR_ICTS_MASK)

#define SW_PORT_PCTFCR_ECTS_MASK                 (0x2U)
#define SW_PORT_PCTFCR_ECTS_SHIFT                (1U)
#define SW_PORT_PCTFCR_ECTS_WIDTH                (1U)
#define SW_PORT_PCTFCR_ECTS(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_PCTFCR_ECTS_SHIFT)) & SW_PORT_PCTFCR_ECTS_MASK)
/*! @} */

/*! @name PISIDCR - Port ingress stream identification configuration register */
/*! @{ */

#define SW_PORT_PISIDCR_KCPAIR_MASK              (0x1U)
#define SW_PORT_PISIDCR_KCPAIR_SHIFT             (0U)
#define SW_PORT_PISIDCR_KCPAIR_WIDTH             (1U)
#define SW_PORT_PISIDCR_KCPAIR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PISIDCR_KCPAIR_SHIFT)) & SW_PORT_PISIDCR_KCPAIR_MASK)

#define SW_PORT_PISIDCR_KC0EN_MASK               (0x2U)
#define SW_PORT_PISIDCR_KC0EN_SHIFT              (1U)
#define SW_PORT_PISIDCR_KC0EN_WIDTH              (1U)
#define SW_PORT_PISIDCR_KC0EN(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PISIDCR_KC0EN_SHIFT)) & SW_PORT_PISIDCR_KC0EN_MASK)

#define SW_PORT_PISIDCR_KC1EN_MASK               (0x4U)
#define SW_PORT_PISIDCR_KC1EN_SHIFT              (2U)
#define SW_PORT_PISIDCR_KC1EN_WIDTH              (1U)
#define SW_PORT_PISIDCR_KC1EN(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PISIDCR_KC1EN_SHIFT)) & SW_PORT_PISIDCR_KC1EN_MASK)

#define SW_PORT_PISIDCR_ISEID_MASK               (0xFFFF0000U)
#define SW_PORT_PISIDCR_ISEID_SHIFT              (16U)
#define SW_PORT_PISIDCR_ISEID_WIDTH              (16U)
#define SW_PORT_PISIDCR_ISEID(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PISIDCR_ISEID_SHIFT)) & SW_PORT_PISIDCR_ISEID_MASK)
/*! @} */

/*! @name PFMCR - Port frame modification configuration register */
/*! @{ */

#define SW_PORT_PFMCR_FMMA_MASK                  (0x1U)
#define SW_PORT_PFMCR_FMMA_SHIFT                 (0U)
#define SW_PORT_PFMCR_FMMA_WIDTH                 (1U)
#define SW_PORT_PFMCR_FMMA(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_PFMCR_FMMA_SHIFT)) & SW_PORT_PFMCR_FMMA_MASK)
/*! @} */

/*! @name PIPV2QMR0 - Port IPV to queue mapping register 0 */
/*! @{ */

#define SW_PORT_PIPV2QMR0_IPV0_Q_MASK            (0xFU)
#define SW_PORT_PIPV2QMR0_IPV0_Q_SHIFT           (0U)
#define SW_PORT_PIPV2QMR0_IPV0_Q_WIDTH           (4U)
#define SW_PORT_PIPV2QMR0_IPV0_Q(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PIPV2QMR0_IPV0_Q_SHIFT)) & SW_PORT_PIPV2QMR0_IPV0_Q_MASK)

#define SW_PORT_PIPV2QMR0_IPV1_Q_MASK            (0xF0U)
#define SW_PORT_PIPV2QMR0_IPV1_Q_SHIFT           (4U)
#define SW_PORT_PIPV2QMR0_IPV1_Q_WIDTH           (4U)
#define SW_PORT_PIPV2QMR0_IPV1_Q(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PIPV2QMR0_IPV1_Q_SHIFT)) & SW_PORT_PIPV2QMR0_IPV1_Q_MASK)

#define SW_PORT_PIPV2QMR0_IPV2_Q_MASK            (0xF00U)
#define SW_PORT_PIPV2QMR0_IPV2_Q_SHIFT           (8U)
#define SW_PORT_PIPV2QMR0_IPV2_Q_WIDTH           (4U)
#define SW_PORT_PIPV2QMR0_IPV2_Q(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PIPV2QMR0_IPV2_Q_SHIFT)) & SW_PORT_PIPV2QMR0_IPV2_Q_MASK)

#define SW_PORT_PIPV2QMR0_IPV3_Q_MASK            (0xF000U)
#define SW_PORT_PIPV2QMR0_IPV3_Q_SHIFT           (12U)
#define SW_PORT_PIPV2QMR0_IPV3_Q_WIDTH           (4U)
#define SW_PORT_PIPV2QMR0_IPV3_Q(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PIPV2QMR0_IPV3_Q_SHIFT)) & SW_PORT_PIPV2QMR0_IPV3_Q_MASK)

#define SW_PORT_PIPV2QMR0_IPV4_Q_MASK            (0xF0000U)
#define SW_PORT_PIPV2QMR0_IPV4_Q_SHIFT           (16U)
#define SW_PORT_PIPV2QMR0_IPV4_Q_WIDTH           (4U)
#define SW_PORT_PIPV2QMR0_IPV4_Q(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PIPV2QMR0_IPV4_Q_SHIFT)) & SW_PORT_PIPV2QMR0_IPV4_Q_MASK)

#define SW_PORT_PIPV2QMR0_IPV5_Q_MASK            (0xF00000U)
#define SW_PORT_PIPV2QMR0_IPV5_Q_SHIFT           (20U)
#define SW_PORT_PIPV2QMR0_IPV5_Q_WIDTH           (4U)
#define SW_PORT_PIPV2QMR0_IPV5_Q(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PIPV2QMR0_IPV5_Q_SHIFT)) & SW_PORT_PIPV2QMR0_IPV5_Q_MASK)

#define SW_PORT_PIPV2QMR0_IPV6_Q_MASK            (0xF000000U)
#define SW_PORT_PIPV2QMR0_IPV6_Q_SHIFT           (24U)
#define SW_PORT_PIPV2QMR0_IPV6_Q_WIDTH           (4U)
#define SW_PORT_PIPV2QMR0_IPV6_Q(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PIPV2QMR0_IPV6_Q_SHIFT)) & SW_PORT_PIPV2QMR0_IPV6_Q_MASK)

#define SW_PORT_PIPV2QMR0_IPV7_Q_MASK            (0xF0000000U)
#define SW_PORT_PIPV2QMR0_IPV7_Q_SHIFT           (28U)
#define SW_PORT_PIPV2QMR0_IPV7_Q_WIDTH           (4U)
#define SW_PORT_PIPV2QMR0_IPV7_Q(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PIPV2QMR0_IPV7_Q_SHIFT)) & SW_PORT_PIPV2QMR0_IPV7_Q_MASK)
/*! @} */

