zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_PORT.h
/*! @name PTCMINLR - Port time capture minimum latency register */
/*! @{ */

#define SW_PORT_PTCMINLR_LATENCY_MASK            (0x3FFFFFFFU)
#define SW_PORT_PTCMINLR_LATENCY_SHIFT           (0U)
#define SW_PORT_PTCMINLR_LATENCY_WIDTH           (30U)
#define SW_PORT_PTCMINLR_LATENCY(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTCMINLR_LATENCY_SHIFT)) & SW_PORT_PTCMINLR_LATENCY_MASK)

#define SW_PORT_PTCMINLR_COUNT_MASK              (0xC0000000U)
#define SW_PORT_PTCMINLR_COUNT_SHIFT             (30U)
#define SW_PORT_PTCMINLR_COUNT_WIDTH             (2U)
#define SW_PORT_PTCMINLR_COUNT(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTCMINLR_COUNT_SHIFT)) & SW_PORT_PTCMINLR_COUNT_MASK)
/*! @} */

/*! @name PTCMAXLR - Port time capture maximum latency register */
/*! @{ */

#define SW_PORT_PTCMAXLR_LATENCY_MASK            (0x3FFFFFFFU)
#define SW_PORT_PTCMAXLR_LATENCY_SHIFT           (0U)
#define SW_PORT_PTCMAXLR_LATENCY_WIDTH           (30U)
#define SW_PORT_PTCMAXLR_LATENCY(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_PTCMAXLR_LATENCY_SHIFT)) & SW_PORT_PTCMAXLR_LATENCY_MASK)
/*! @} */

/*! @name PSRCR - Port seamless redundancy configuration register */
/*! @{ */

#define SW_PORT_PSRCR_TX_SQTA_MASK               (0x10U)
#define SW_PORT_PSRCR_TX_SQTA_SHIFT              (4U)
#define SW_PORT_PSRCR_TX_SQTA_WIDTH              (1U)
#define SW_PORT_PSRCR_TX_SQTA(x)                 (((uint32_t)(((uint32_t)(x)) << SW_PORT_PSRCR_TX_SQTA_SHIFT)) & SW_PORT_PSRCR_TX_SQTA_MASK)

#define SW_PORT_PSRCR_PATHID_MASK                (0xF00U)
#define SW_PORT_PSRCR_PATHID_SHIFT               (8U)
#define SW_PORT_PSRCR_PATHID_WIDTH               (4U)
#define SW_PORT_PSRCR_PATHID(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_PSRCR_PATHID_SHIFT)) & SW_PORT_PSRCR_PATHID_MASK)

#define SW_PORT_PSRCR_ISQG_EID_MASK              (0xFFFF0000U)
#define SW_PORT_PSRCR_ISQG_EID_SHIFT             (16U)
#define SW_PORT_PSRCR_ISQG_EID_WIDTH             (16U)
#define SW_PORT_PSRCR_ISQG_EID(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_PSRCR_ISQG_EID_SHIFT)) & SW_PORT_PSRCR_ISQG_EID_MASK)
/*! @} */

/*! @name BPCR - Bridge port configuration register */
/*! @{ */

#define SW_PORT_BPCR_DYN_LIMIT_MASK              (0xFFFFU)
#define SW_PORT_BPCR_DYN_LIMIT_SHIFT             (0U)
#define SW_PORT_BPCR_DYN_LIMIT_WIDTH             (16U)
#define SW_PORT_BPCR_DYN_LIMIT(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPCR_DYN_LIMIT_SHIFT)) & SW_PORT_BPCR_DYN_LIMIT_MASK)

#define SW_PORT_BPCR_MLO_MASK                    (0x700000U)
#define SW_PORT_BPCR_MLO_SHIFT                   (20U)
#define SW_PORT_BPCR_MLO_WIDTH                   (3U)
#define SW_PORT_BPCR_MLO(x)                      (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPCR_MLO_SHIFT)) & SW_PORT_BPCR_MLO_MASK)

#define SW_PORT_BPCR_UUCASTE_MASK                (0x1000000U)
#define SW_PORT_BPCR_UUCASTE_SHIFT               (24U)
#define SW_PORT_BPCR_UUCASTE_WIDTH               (1U)
#define SW_PORT_BPCR_UUCASTE(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPCR_UUCASTE_SHIFT)) & SW_PORT_BPCR_UUCASTE_MASK)

#define SW_PORT_BPCR_UMCASTE_MASK                (0x2000000U)
#define SW_PORT_BPCR_UMCASTE_SHIFT               (25U)
#define SW_PORT_BPCR_UMCASTE_WIDTH               (1U)
#define SW_PORT_BPCR_UMCASTE(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPCR_UMCASTE_SHIFT)) & SW_PORT_BPCR_UMCASTE_MASK)

#define SW_PORT_BPCR_MCASTE_MASK                 (0x4000000U)
#define SW_PORT_BPCR_MCASTE_SHIFT                (26U)
#define SW_PORT_BPCR_MCASTE_WIDTH                (1U)
#define SW_PORT_BPCR_MCASTE(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPCR_MCASTE_SHIFT)) & SW_PORT_BPCR_MCASTE_MASK)

#define SW_PORT_BPCR_BCASTE_MASK                 (0x8000000U)
#define SW_PORT_BPCR_BCASTE_SHIFT                (27U)
#define SW_PORT_BPCR_BCASTE_WIDTH                (1U)
#define SW_PORT_BPCR_BCASTE(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPCR_BCASTE_SHIFT)) & SW_PORT_BPCR_BCASTE_MASK)

#define SW_PORT_BPCR_STAMVD_MASK                 (0x10000000U)
#define SW_PORT_BPCR_STAMVD_SHIFT                (28U)
#define SW_PORT_BPCR_STAMVD_WIDTH                (1U)
#define SW_PORT_BPCR_STAMVD(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPCR_STAMVD_SHIFT)) & SW_PORT_BPCR_STAMVD_MASK)

#define SW_PORT_BPCR_SRCPRND_MASK                (0x20000000U)
#define SW_PORT_BPCR_SRCPRND_SHIFT               (29U)
#define SW_PORT_BPCR_SRCPRND_WIDTH               (1U)
#define SW_PORT_BPCR_SRCPRND(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPCR_SRCPRND_SHIFT)) & SW_PORT_BPCR_SRCPRND_MASK)
/*! @} */

/*! @name BPDVR - Bridge port default VLAN register */
/*! @{ */

#define SW_PORT_BPDVR_VID_MASK                   (0xFFFU)
#define SW_PORT_BPDVR_VID_SHIFT                  (0U)
#define SW_PORT_BPDVR_VID_WIDTH                  (12U)
#define SW_PORT_BPDVR_VID(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDVR_VID_SHIFT)) & SW_PORT_BPDVR_VID_MASK)

#define SW_PORT_BPDVR_DEI_MASK                   (0x1000U)
#define SW_PORT_BPDVR_DEI_SHIFT                  (12U)
#define SW_PORT_BPDVR_DEI_WIDTH                  (1U)
#define SW_PORT_BPDVR_DEI(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDVR_DEI_SHIFT)) & SW_PORT_BPDVR_DEI_MASK)

#define SW_PORT_BPDVR_PCP_MASK                   (0xE000U)
#define SW_PORT_BPDVR_PCP_SHIFT                  (13U)
#define SW_PORT_BPDVR_PCP_WIDTH                  (3U)
#define SW_PORT_BPDVR_PCP(x)                     (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDVR_PCP_SHIFT)) & SW_PORT_BPDVR_PCP_MASK)

#define SW_PORT_BPDVR_TPID_MASK                  (0x10000U)
#define SW_PORT_BPDVR_TPID_SHIFT                 (16U)
#define SW_PORT_BPDVR_TPID_WIDTH                 (1U)
#define SW_PORT_BPDVR_TPID(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDVR_TPID_SHIFT)) & SW_PORT_BPDVR_TPID_MASK)

#define SW_PORT_BPDVR_RXTAGA_MASK                (0xF00000U)
#define SW_PORT_BPDVR_RXTAGA_SHIFT               (20U)
#define SW_PORT_BPDVR_RXTAGA_WIDTH               (4U)
#define SW_PORT_BPDVR_RXTAGA(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDVR_RXTAGA_SHIFT)) & SW_PORT_BPDVR_RXTAGA_MASK)

#define SW_PORT_BPDVR_RXVAM_MASK                 (0x1000000U)
#define SW_PORT_BPDVR_RXVAM_SHIFT                (24U)
#define SW_PORT_BPDVR_RXVAM_WIDTH                (1U)
#define SW_PORT_BPDVR_RXVAM(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDVR_RXVAM_SHIFT)) & SW_PORT_BPDVR_RXVAM_MASK)

#define SW_PORT_BPDVR_TXTAGA_MASK                (0x6000000U)
#define SW_PORT_BPDVR_TXTAGA_SHIFT               (25U)
#define SW_PORT_BPDVR_TXTAGA_WIDTH               (2U)
#define SW_PORT_BPDVR_TXTAGA(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDVR_TXTAGA_SHIFT)) & SW_PORT_BPDVR_TXTAGA_MASK)
/*! @} */

/*! @name BPSTGSR - Bridge port spanning tree group state register */
/*! @{ */

#define SW_PORT_BPSTGSR_STG_STATE0_MASK          (0x3U)
#define SW_PORT_BPSTGSR_STG_STATE0_SHIFT         (0U)
#define SW_PORT_BPSTGSR_STG_STATE0_WIDTH         (2U)
#define SW_PORT_BPSTGSR_STG_STATE0(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE0_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE0_MASK)

#define SW_PORT_BPSTGSR_STG_STATE1_MASK          (0xCU)
#define SW_PORT_BPSTGSR_STG_STATE1_SHIFT         (2U)
#define SW_PORT_BPSTGSR_STG_STATE1_WIDTH         (2U)
#define SW_PORT_BPSTGSR_STG_STATE1(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE1_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE1_MASK)

#define SW_PORT_BPSTGSR_STG_STATE2_MASK          (0x30U)
#define SW_PORT_BPSTGSR_STG_STATE2_SHIFT         (4U)
#define SW_PORT_BPSTGSR_STG_STATE2_WIDTH         (2U)
#define SW_PORT_BPSTGSR_STG_STATE2(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE2_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE2_MASK)

#define SW_PORT_BPSTGSR_STG_STATE3_MASK          (0xC0U)
#define SW_PORT_BPSTGSR_STG_STATE3_SHIFT         (6U)
#define SW_PORT_BPSTGSR_STG_STATE3_WIDTH         (2U)
#define SW_PORT_BPSTGSR_STG_STATE3(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE3_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE3_MASK)

#define SW_PORT_BPSTGSR_STG_STATE4_MASK          (0x300U)
#define SW_PORT_BPSTGSR_STG_STATE4_SHIFT         (8U)
#define SW_PORT_BPSTGSR_STG_STATE4_WIDTH         (2U)
#define SW_PORT_BPSTGSR_STG_STATE4(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE4_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE4_MASK)

#define SW_PORT_BPSTGSR_STG_STATE5_MASK          (0xC00U)
#define SW_PORT_BPSTGSR_STG_STATE5_SHIFT         (10U)
#define SW_PORT_BPSTGSR_STG_STATE5_WIDTH         (2U)
#define SW_PORT_BPSTGSR_STG_STATE5(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE5_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE5_MASK)

