zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_PORT.h
#define SW_PORT_BPSTGSR_STG_STATE6_MASK          (0x3000U)
#define SW_PORT_BPSTGSR_STG_STATE6_SHIFT         (12U)
#define SW_PORT_BPSTGSR_STG_STATE6_WIDTH         (2U)
#define SW_PORT_BPSTGSR_STG_STATE6(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE6_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE6_MASK)

#define SW_PORT_BPSTGSR_STG_STATE7_MASK          (0xC000U)
#define SW_PORT_BPSTGSR_STG_STATE7_SHIFT         (14U)
#define SW_PORT_BPSTGSR_STG_STATE7_WIDTH         (2U)
#define SW_PORT_BPSTGSR_STG_STATE7(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE7_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE7_MASK)

#define SW_PORT_BPSTGSR_STG_STATE8_MASK          (0x30000U)
#define SW_PORT_BPSTGSR_STG_STATE8_SHIFT         (16U)
#define SW_PORT_BPSTGSR_STG_STATE8_WIDTH         (2U)
#define SW_PORT_BPSTGSR_STG_STATE8(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE8_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE8_MASK)

#define SW_PORT_BPSTGSR_STG_STATE9_MASK          (0xC0000U)
#define SW_PORT_BPSTGSR_STG_STATE9_SHIFT         (18U)
#define SW_PORT_BPSTGSR_STG_STATE9_WIDTH         (2U)
#define SW_PORT_BPSTGSR_STG_STATE9(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE9_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE9_MASK)

#define SW_PORT_BPSTGSR_STG_STATE10_MASK         (0x300000U)
#define SW_PORT_BPSTGSR_STG_STATE10_SHIFT        (20U)
#define SW_PORT_BPSTGSR_STG_STATE10_WIDTH        (2U)
#define SW_PORT_BPSTGSR_STG_STATE10(x)           (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE10_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE10_MASK)

#define SW_PORT_BPSTGSR_STG_STATE11_MASK         (0xC00000U)
#define SW_PORT_BPSTGSR_STG_STATE11_SHIFT        (22U)
#define SW_PORT_BPSTGSR_STG_STATE11_WIDTH        (2U)
#define SW_PORT_BPSTGSR_STG_STATE11(x)           (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE11_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE11_MASK)

#define SW_PORT_BPSTGSR_STG_STATE12_MASK         (0x3000000U)
#define SW_PORT_BPSTGSR_STG_STATE12_SHIFT        (24U)
#define SW_PORT_BPSTGSR_STG_STATE12_WIDTH        (2U)
#define SW_PORT_BPSTGSR_STG_STATE12(x)           (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE12_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE12_MASK)

#define SW_PORT_BPSTGSR_STG_STATE13_MASK         (0xC000000U)
#define SW_PORT_BPSTGSR_STG_STATE13_SHIFT        (26U)
#define SW_PORT_BPSTGSR_STG_STATE13_WIDTH        (2U)
#define SW_PORT_BPSTGSR_STG_STATE13(x)           (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE13_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE13_MASK)

#define SW_PORT_BPSTGSR_STG_STATE14_MASK         (0x30000000U)
#define SW_PORT_BPSTGSR_STG_STATE14_SHIFT        (28U)
#define SW_PORT_BPSTGSR_STG_STATE14_WIDTH        (2U)
#define SW_PORT_BPSTGSR_STG_STATE14(x)           (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE14_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE14_MASK)

#define SW_PORT_BPSTGSR_STG_STATE15_MASK         (0xC0000000U)
#define SW_PORT_BPSTGSR_STG_STATE15_SHIFT        (30U)
#define SW_PORT_BPSTGSR_STG_STATE15_WIDTH        (2U)
#define SW_PORT_BPSTGSR_STG_STATE15(x)           (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSTGSR_STG_STATE15_SHIFT)) & SW_PORT_BPSTGSR_STG_STATE15_MASK)
/*! @} */

/*! @name BPSCR0 - Bridge port storm control register 0 */
/*! @{ */

#define SW_PORT_BPSCR0_UUCASTRPEID_MASK          (0xFFFFU)
#define SW_PORT_BPSCR0_UUCASTRPEID_SHIFT         (0U)
#define SW_PORT_BPSCR0_UUCASTRPEID_WIDTH         (16U)
#define SW_PORT_BPSCR0_UUCASTRPEID(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSCR0_UUCASTRPEID_SHIFT)) & SW_PORT_BPSCR0_UUCASTRPEID_MASK)

#define SW_PORT_BPSCR0_BCASTRPEID_MASK           (0xFFFF0000U)
#define SW_PORT_BPSCR0_BCASTRPEID_SHIFT          (16U)
#define SW_PORT_BPSCR0_BCASTRPEID_WIDTH          (16U)
#define SW_PORT_BPSCR0_BCASTRPEID(x)             (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSCR0_BCASTRPEID_SHIFT)) & SW_PORT_BPSCR0_BCASTRPEID_MASK)
/*! @} */

/*! @name BPSCR1 - Bridge port storm control register 1 */
/*! @{ */

#define SW_PORT_BPSCR1_MCASTRPEID_MASK           (0xFFFFU)
#define SW_PORT_BPSCR1_MCASTRPEID_SHIFT          (0U)
#define SW_PORT_BPSCR1_MCASTRPEID_WIDTH          (16U)
#define SW_PORT_BPSCR1_MCASTRPEID(x)             (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSCR1_MCASTRPEID_SHIFT)) & SW_PORT_BPSCR1_MCASTRPEID_MASK)

#define SW_PORT_BPSCR1_UMCASTRPEID_MASK          (0xFFFF0000U)
#define SW_PORT_BPSCR1_UMCASTRPEID_SHIFT         (16U)
#define SW_PORT_BPSCR1_UMCASTRPEID_WIDTH         (16U)
#define SW_PORT_BPSCR1_UMCASTRPEID(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPSCR1_UMCASTRPEID_SHIFT)) & SW_PORT_BPSCR1_UMCASTRPEID_MASK)
/*! @} */

/*! @name BPOR - Bridge port operational register */
/*! @{ */

#define SW_PORT_BPOR_NUM_DYN_MASK                (0xFFFFU)
#define SW_PORT_BPOR_NUM_DYN_SHIFT               (0U)
#define SW_PORT_BPOR_NUM_DYN_WIDTH               (16U)
#define SW_PORT_BPOR_NUM_DYN(x)                  (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPOR_NUM_DYN_SHIFT)) & SW_PORT_BPOR_NUM_DYN_MASK)
/*! @} */

/*! @name BPDCR - Bridge port discard count register */
/*! @{ */

#define SW_PORT_BPDCR_COUNT_MASK                 (0xFFFFFFFFU)
#define SW_PORT_BPDCR_COUNT_SHIFT                (0U)
#define SW_PORT_BPDCR_COUNT_WIDTH                (32U)
#define SW_PORT_BPDCR_COUNT(x)                   (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDCR_COUNT_SHIFT)) & SW_PORT_BPDCR_COUNT_MASK)
/*! @} */

/*! @name BPDCRR0 - Bridge port discard count reason register 0 */
/*! @{ */

#define SW_PORT_BPDCRR0_BPACDR_MASK              (0x1U)
#define SW_PORT_BPDCRR0_BPACDR_SHIFT             (0U)
#define SW_PORT_BPDCRR0_BPACDR_WIDTH             (1U)
#define SW_PORT_BPDCRR0_BPACDR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDCRR0_BPACDR_SHIFT)) & SW_PORT_BPDCRR0_BPACDR_MASK)

#define SW_PORT_BPDCRR0_ISTGSDR_MASK             (0x2U)
#define SW_PORT_BPDCRR0_ISTGSDR_SHIFT            (1U)
#define SW_PORT_BPDCRR0_ISTGSDR_WIDTH            (1U)
#define SW_PORT_BPDCRR0_ISTGSDR(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDCRR0_ISTGSDR_SHIFT)) & SW_PORT_BPDCRR0_ISTGSDR_MASK)

#define SW_PORT_BPDCRR0_BPVFLTDR_MASK            (0x4U)
#define SW_PORT_BPDCRR0_BPVFLTDR_SHIFT           (2U)
#define SW_PORT_BPDCRR0_BPVFLTDR_WIDTH           (1U)
#define SW_PORT_BPDCRR0_BPVFLTDR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDCRR0_BPVFLTDR_SHIFT)) & SW_PORT_BPDCRR0_BPVFLTDR_MASK)

