zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_PORT.h
#define SW_PORT_BPDCRR0_MACLNFDR_MASK            (0x8U)
#define SW_PORT_BPDCRR0_MACLNFDR_SHIFT           (3U)
#define SW_PORT_BPDCRR0_MACLNFDR_WIDTH           (1U)
#define SW_PORT_BPDCRR0_MACLNFDR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDCRR0_MACLNFDR_SHIFT)) & SW_PORT_BPDCRR0_MACLNFDR_MASK)

#define SW_PORT_BPDCRR0_STAMVDDR_MASK            (0x80U)
#define SW_PORT_BPDCRR0_STAMVDDR_SHIFT           (7U)
#define SW_PORT_BPDCRR0_STAMVDDR_WIDTH           (1U)
#define SW_PORT_BPDCRR0_STAMVDDR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDCRR0_STAMVDDR_SHIFT)) & SW_PORT_BPDCRR0_STAMVDDR_MASK)

#define SW_PORT_BPDCRR0_MACFDDDR_MASK            (0x100U)
#define SW_PORT_BPDCRR0_MACFDDDR_SHIFT           (8U)
#define SW_PORT_BPDCRR0_MACFDDDR_WIDTH           (1U)
#define SW_PORT_BPDCRR0_MACFDDDR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDCRR0_MACFDDDR_SHIFT)) & SW_PORT_BPDCRR0_MACFDDDR_MASK)

#define SW_PORT_BPDCRR0_NODESTDR_MASK            (0x200U)
#define SW_PORT_BPDCRR0_NODESTDR_SHIFT           (9U)
#define SW_PORT_BPDCRR0_NODESTDR_WIDTH           (1U)
#define SW_PORT_BPDCRR0_NODESTDR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDCRR0_NODESTDR_SHIFT)) & SW_PORT_BPDCRR0_NODESTDR_MASK)

#define SW_PORT_BPDCRR0_IPMFDR_MASK              (0x400U)
#define SW_PORT_BPDCRR0_IPMFDR_SHIFT             (10U)
#define SW_PORT_BPDCRR0_IPMFDR_WIDTH             (1U)
#define SW_PORT_BPDCRR0_IPMFDR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDCRR0_IPMFDR_SHIFT)) & SW_PORT_BPDCRR0_IPMFDR_MASK)

#define SW_PORT_BPDCRR0_UFMMDR_MASK              (0x800U)
#define SW_PORT_BPDCRR0_UFMMDR_SHIFT             (11U)
#define SW_PORT_BPDCRR0_UFMMDR_WIDTH             (1U)
#define SW_PORT_BPDCRR0_UFMMDR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDCRR0_UFMMDR_SHIFT)) & SW_PORT_BPDCRR0_UFMMDR_MASK)

#define SW_PORT_BPDCRR0_MISCDR_MASK              (0x1000U)
#define SW_PORT_BPDCRR0_MISCDR_SHIFT             (12U)
#define SW_PORT_BPDCRR0_MISCDR_WIDTH             (1U)
#define SW_PORT_BPDCRR0_MISCDR(x)                (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDCRR0_MISCDR_SHIFT)) & SW_PORT_BPDCRR0_MISCDR_MASK)

#define SW_PORT_BPDCRR0_STRMCTRLDR_MASK          (0x2000U)
#define SW_PORT_BPDCRR0_STRMCTRLDR_SHIFT         (13U)
#define SW_PORT_BPDCRR0_STRMCTRLDR_WIDTH         (1U)
#define SW_PORT_BPDCRR0_STRMCTRLDR(x)            (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDCRR0_STRMCTRLDR_SHIFT)) & SW_PORT_BPDCRR0_STRMCTRLDR_MASK)
/*! @} */

/*! @name BPDCRR1 - Bridge port discard count reason register 1 */
/*! @{ */

#define SW_PORT_BPDCRR1_ENTRYID_MASK             (0x7FFFFFFU)
#define SW_PORT_BPDCRR1_ENTRYID_SHIFT            (0U)
#define SW_PORT_BPDCRR1_ENTRYID_WIDTH            (27U)
#define SW_PORT_BPDCRR1_ENTRYID(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDCRR1_ENTRYID_SHIFT)) & SW_PORT_BPDCRR1_ENTRYID_MASK)

#define SW_PORT_BPDCRR1_TT_MASK                  (0xF0000000U)
#define SW_PORT_BPDCRR1_TT_SHIFT                 (28U)
#define SW_PORT_BPDCRR1_TT_WIDTH                 (4U)
#define SW_PORT_BPDCRR1_TT(x)                    (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPDCRR1_TT_SHIFT)) & SW_PORT_BPDCRR1_TT_MASK)
/*! @} */

/*! @name BPMLFSR - Bridge port MAC learning failure status register */
/*! @{ */

#define SW_PORT_BPMLFSR_BPMLLRFR_MASK            (0x1U)
#define SW_PORT_BPMLFSR_BPMLLRFR_SHIFT           (0U)
#define SW_PORT_BPMLFSR_BPMLLRFR_WIDTH           (1U)
#define SW_PORT_BPMLFSR_BPMLLRFR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPMLFSR_BPMLLRFR_SHIFT)) & SW_PORT_BPMLFSR_BPMLLRFR_MASK)

#define SW_PORT_BPMLFSR_FFDBTRFR_MASK            (0x2U)
#define SW_PORT_BPMLFSR_FFDBTRFR_SHIFT           (1U)
#define SW_PORT_BPMLFSR_FFDBTRFR_WIDTH           (1U)
#define SW_PORT_BPMLFSR_FFDBTRFR(x)              (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPMLFSR_FFDBTRFR_SHIFT)) & SW_PORT_BPMLFSR_FFDBTRFR_MASK)

#define SW_PORT_BPMLFSR_HCCLRFR_MASK             (0x4U)
#define SW_PORT_BPMLFSR_HCCLRFR_SHIFT            (2U)
#define SW_PORT_BPMLFSR_HCCLRFR_WIDTH            (1U)
#define SW_PORT_BPMLFSR_HCCLRFR(x)               (((uint32_t)(((uint32_t)(x)) << SW_PORT_BPMLFSR_HCCLRFR_SHIFT)) & SW_PORT_BPMLFSR_HCCLRFR_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group SW_PORT_Register_Masks */

/*!
 * @}
 */ /* end of group SW_PORT_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_SW_PORT_H_) */
